{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "fce3fb50-092b-4392-80df-258a0450f414",
   "metadata": {},
   "source": [
    "# Consultas Integradas"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "400fd7b0-612f-4d19-bcf5-f7e4020347bd",
   "metadata": {},
   "source": [
    "Este notebook tiene el fin de generar las consultas planteadas en el trabajo práctico integrador"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "d03161d8-e77b-42c1-8ef9-5e692a142baa",
   "metadata": {},
   "source": [
    "#### Importo librerias"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 83,
   "id": "d0ae8dc4",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "The autoreload extension is already loaded. To reload it, use:\n",
      "  %reload_ext autoreload\n"
     ]
    }
   ],
   "source": [
    "# Limpia todas las variables existentes\n",
    "%reset -f\n",
    "\n",
    "# Habilita autoreload para recargar automáticamente todos los módulos\n",
    "%load_ext autoreload\n",
    "%autoreload 2"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 84,
   "id": "082c6b7a",
   "metadata": {},
   "outputs": [],
   "source": [
    "import os\n",
    "from pathlib import Path\n",
    "import pandas as pd\n",
    "from pymongo.errors import ConnectionFailure\n",
    "from db_connections import client, db_neo4j, db_redis\n",
    "from src import mongo, neo4j, utils, redis\n",
    "from IPython.display import display"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 85,
   "id": "d03acb47",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "✅ Conexión a MongoDB verificada.\n",
      "✅ Conexión a Neo4j verificada.\n",
      "✅ Conexión a Redis verificada.\n"
     ]
    }
   ],
   "source": [
    "# =====================\n",
    "# TEST DE CONEXIONES\n",
    "# =====================\n",
    "\n",
    "#Conecto con MongoDB\n",
    "try:\n",
    "    client.admin.command(\"ping\")  # fuerza conexión al servidor\n",
    "    print(\"✅ Conexión a MongoDB verificada.\")\n",
    "except ConnectionFailure as e:\n",
    "    print(f\"❌ Falló la conexión: {type(e).__name__} - {e}\")\n",
    "\n",
    "#Conecto con Neo4j\n",
    "try:\n",
    "    db_neo4j.verify_connectivity()\n",
    "    print(\"✅ Conexión a Neo4j verificada.\")\n",
    "except Exception as e:\n",
    "    print(f\"❌ Error de conexión: {type(e).__name__} - {e}\")\n",
    "\n",
    "#Conecto con Redis\n",
    "try:\n",
    "    db_redis.ping()\n",
    "    print(\"✅ Conexión a Redis verificada.\")\n",
    "except Exception as e:\n",
    "    print(f\"❌ Error de conexión: {type(e).__name__} - {e}\")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "f37c8ea9-4542-4e3d-bf9f-a7653c247358",
   "metadata": {},
   "source": [
    "### A.Mostrar los usuarios que visitaron “Bariloche”. "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 55,
   "id": "baf85df9-27c5-4a9b-8501-d2e5ada1f279",
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "------------------------------------------------------------\n",
      "USUARIOS QUE VISITARON BARILOCHE\n",
      "------------------------------------------------------------\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<style type=\"text/css\">\n",
       "</style>\n",
       "<table id=\"T_1ee50\">\n",
       "  <thead>\n",
       "    <tr>\n",
       "      <th id=\"T_1ee50_level0_col0\" class=\"col_heading level0 col0\" >Nombre</th>\n",
       "      <th id=\"T_1ee50_level0_col1\" class=\"col_heading level0 col1\" >Apellido</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <td id=\"T_1ee50_row0_col0\" class=\"data row0 col0\" >Agapito</td>\n",
       "      <td id=\"T_1ee50_row0_col1\" class=\"data row0 col1\" >Sedano</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_1ee50_row1_col0\" class=\"data row1 col0\" >Candela</td>\n",
       "      <td id=\"T_1ee50_row1_col1\" class=\"data row1 col1\" >Solano</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_1ee50_row2_col0\" class=\"data row2 col0\" >Ovidio</td>\n",
       "      <td id=\"T_1ee50_row2_col1\" class=\"data row2 col1\" >Romero</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_1ee50_row3_col0\" class=\"data row3 col0\" >Fernanda</td>\n",
       "      <td id=\"T_1ee50_row3_col1\" class=\"data row3 col1\" >Romero</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_1ee50_row4_col0\" class=\"data row4 col0\" >Eliseo</td>\n",
       "      <td id=\"T_1ee50_row4_col1\" class=\"data row4 col1\" >Sobrino</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n"
      ],
      "text/plain": [
       "<pandas.io.formats.style.Styler at 0x7f21ecac7710>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "query = \"\"\" \n",
    "MATCH (U:Usuario)-[:VISITO]->(D:Destino)\n",
    "WHERE D.ciudad='La Plata'\n",
    "RETURN U.nombre AS Nombre, U.apellido AS Apellido\n",
    "\"\"\"\n",
    "\n",
    "usuarios = neo4j.consulta(db_neo4j, query)\n",
    "usuarios\n",
    "\n",
    "print(\"\\n\" + \"-\"*60)\n",
    "print(\"USUARIOS QUE VISITARON BARILOCHE\")\n",
    "print(\"-\"*60)\n",
    "display(usuarios.style.hide(axis=\"index\"))"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "8aee4bec-64dd-4b91-a4bf-b8890e15e249",
   "metadata": {},
   "source": [
    "### B.Mostrar los amigos de Juan que visitaron algún destino que visitó él, mostrar el nombre del Usuario y el destino. "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 56,
   "id": "50903c86-e8e3-4bde-873f-33df0ef8d56a",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "------------------------------------------------------------\n",
      "JUAN TUS AMIGOS VISITARON ESTOS MISMOS DESTINOS QUE TÚ\n",
      "------------------------------------------------------------\n",
      "\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<style type=\"text/css\">\n",
       "</style>\n",
       "<table id=\"T_f5438\">\n",
       "  <thead>\n",
       "    <tr>\n",
       "      <th id=\"T_f5438_level0_col0\" class=\"col_heading level0 col0\" >Nombre</th>\n",
       "      <th id=\"T_f5438_level0_col1\" class=\"col_heading level0 col1\" >Destinos_Compartidos</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <td id=\"T_f5438_row0_col0\" class=\"data row0 col0\" >Adela</td>\n",
       "      <td id=\"T_f5438_row0_col1\" class=\"data row0 col1\" >Posadas</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_f5438_row1_col0\" class=\"data row1 col0\" >Amor</td>\n",
       "      <td id=\"T_f5438_row1_col1\" class=\"data row1 col1\" >San Fernando, Villa Carlos Paz, Posadas, Salta</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_f5438_row2_col0\" class=\"data row2 col0\" >Ariadna</td>\n",
       "      <td id=\"T_f5438_row2_col1\" class=\"data row2 col1\" >Resistencia, Posadas, Salta, San Luis, Santa Fe, Santiago del Estero</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_f5438_row3_col0\" class=\"data row3 col0\" >Coral</td>\n",
       "      <td id=\"T_f5438_row3_col1\" class=\"data row3 col1\" >Río Cuarto, Chilecito, Rosario</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_f5438_row4_col0\" class=\"data row4 col0\" >Dani</td>\n",
       "      <td id=\"T_f5438_row4_col1\" class=\"data row4 col1\" >Posadas, Neuquén, Santiago del Estero</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_f5438_row5_col0\" class=\"data row5 col0\" >David</td>\n",
       "      <td id=\"T_f5438_row5_col1\" class=\"data row5 col1\" >Río Cuarto, Concordia, Santa Rosa, Posadas, Salta, San Luis</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_f5438_row6_col0\" class=\"data row6 col0\" >Emiliana</td>\n",
       "      <td id=\"T_f5438_row6_col1\" class=\"data row6 col1\" >Puerto Madryn, Posadas, El Calafate, Santiago del Estero, San Salvador de Jujuy, Salta</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_f5438_row7_col0\" class=\"data row7 col0\" >Enrique</td>\n",
       "      <td id=\"T_f5438_row7_col1\" class=\"data row7 col1\" >Posadas, El Calafate, Rosario</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_f5438_row8_col0\" class=\"data row8 col0\" >Feliciano</td>\n",
       "      <td id=\"T_f5438_row8_col1\" class=\"data row8 col1\" >Posadas, Neuquén, Salta, Santiago del Estero</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_f5438_row9_col0\" class=\"data row9 col0\" >Georgina</td>\n",
       "      <td id=\"T_f5438_row9_col1\" class=\"data row9 col1\" >San Fernando, Chilecito, Posadas, Rosario, CABA, San Martín de los Andes, Santiago del Estero</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_f5438_row10_col0\" class=\"data row10 col0\" >Juan Antonio</td>\n",
       "      <td id=\"T_f5438_row10_col1\" class=\"data row10 col1\" >Río Cuarto, Posadas, San Martín de los Andes, Santiago del Estero</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_f5438_row11_col0\" class=\"data row11 col0\" >Juan José</td>\n",
       "      <td id=\"T_f5438_row11_col1\" class=\"data row11 col1\" >Río Cuarto, Posadas, San Martín de los Andes, Santiago del Estero</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_f5438_row12_col0\" class=\"data row12 col0\" >Nicolás</td>\n",
       "      <td id=\"T_f5438_row12_col1\" class=\"data row12 col1\" >Villa Carlos Paz, San Salvador de Jujuy, Chilecito, Posadas, El Calafate</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_f5438_row13_col0\" class=\"data row13 col0\" >Omar</td>\n",
       "      <td id=\"T_f5438_row13_col1\" class=\"data row13 col1\" >San Rafael, Posadas, San Martín de los Andes, El Calafate, Rosario, Santiago del Estero</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_f5438_row14_col0\" class=\"data row14 col0\" >Ovidio</td>\n",
       "      <td id=\"T_f5438_row14_col1\" class=\"data row14 col1\" >Villa Carlos Paz, Río Cuarto, El Calafate</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_f5438_row15_col0\" class=\"data row15 col0\" >Pastor</td>\n",
       "      <td id=\"T_f5438_row15_col1\" class=\"data row15 col1\" >San Fernando, Río Cuarto, Chilecito, El Calafate</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_f5438_row16_col0\" class=\"data row16 col0\" >Segismundo</td>\n",
       "      <td id=\"T_f5438_row16_col1\" class=\"data row16 col1\" >San Fernando, El Calafate, Neuquén</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_f5438_row17_col0\" class=\"data row17 col0\" >Vicenta</td>\n",
       "      <td id=\"T_f5438_row17_col1\" class=\"data row17 col1\" >Iguazú, El Calafate</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_f5438_row18_col0\" class=\"data row18 col0\" >Victorino</td>\n",
       "      <td id=\"T_f5438_row18_col1\" class=\"data row18 col1\" >Río Cuarto, San Rafael, Posadas, Iguazú, El Calafate</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n"
      ],
      "text/plain": [
       "<pandas.io.formats.style.Styler at 0x7f21fc0e3490>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "import pandas as pd\n",
    "\n",
    "# Pedimos el nombre del usuario\n",
    "nombre_usuario = input(\"Introduce tu nombre para saber qué lugares visitaste con tus amigos: \")\n",
    "\n",
    "\n",
    "query = \"\"\"\n",
    "MATCH (u:Usuario)\n",
    "WHERE toLower(u.nombre) CONTAINS toLower($nombre)\n",
    "MATCH (u)-[:AMIGO_DE]-(amigo:Usuario)\n",
    "MATCH (u)-[:VISITO]->(d:Destino)<-[:VISITO]-(amigo)\n",
    "RETURN \n",
    "    amigo.nombre AS Nombre,\n",
    "    collect(DISTINCT d.ciudad) AS Destinos_Compartidos\n",
    "ORDER BY Nombre\n",
    "\"\"\"\n",
    "\n",
    "#Encabezado\n",
    "print(\"\\n\" + \"-\"*60)\n",
    "print(f\"{nombre_usuario.upper()} TUS AMIGOS VISITARON ESTOS MISMOS DESTINOS QUE TÚ\")\n",
    "print(\"-\"*60 + \"\\n\")\n",
    "\n",
    "# Ejecutamos la consulta usando la función consulta() que devuelve un DataFrame\n",
    "usuarios = neo4j.consulta(db_neo4j, query, parametros={\"nombre\": nombre_usuario})\n",
    "\n",
    "# Convertimos listas a texto legible\n",
    "usuarios[\"Destinos_Compartidos\"] = usuarios[\"Destinos_Compartidos\"].apply(\n",
    "    lambda lista: \", \".join(lista) if isinstance(lista, list) else lista\n",
    ")\n",
    "\n",
    "\n",
    "\n",
    "# Mostramos el resultado\n",
    "if usuarios.empty:\n",
    "    print(\"No se encontraron amigos que hayan visitado los mismos destinos.\")\n",
    "else:\n",
    "    display(usuarios.style.hide(axis=\"index\"))\n",
    "\n",
    "\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "4f4d3f79-80d4-4638-9c72-1ad410d734ad",
   "metadata": {},
   "source": [
    "### C. Sugerir destinos a un usuario que no haya visitado él ni sus amigos. "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 57,
   "id": "4ac69eb1",
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "------------------------------------------------------------\n",
      "DESTINOS NUEVOS PARA JUAN Y SUS AMIGOS\n",
      "------------------------------------------------------------\n",
      "\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<style type=\"text/css\">\n",
       "</style>\n",
       "<table id=\"T_a115a\">\n",
       "  <thead>\n",
       "    <tr>\n",
       "      <th id=\"T_a115a_level0_col0\" class=\"col_heading level0 col0\" >Destinos_No_Visitados</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <td id=\"T_a115a_row0_col0\" class=\"data row0 col0\" >Bariloche</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_a115a_row1_col0\" class=\"data row1 col0\" >CABA</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_a115a_row2_col0\" class=\"data row2 col0\" >Chilecito</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_a115a_row3_col0\" class=\"data row3 col0\" >Concordia</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_a115a_row4_col0\" class=\"data row4 col0\" >Corrientes</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_a115a_row5_col0\" class=\"data row5 col0\" >Córdoba</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_a115a_row6_col0\" class=\"data row6 col0\" >El Calafate</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_a115a_row7_col0\" class=\"data row7 col0\" >Formosa</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_a115a_row8_col0\" class=\"data row8 col0\" >Gualeguaychú</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_a115a_row9_col0\" class=\"data row9 col0\" >Iguazú</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_a115a_row10_col0\" class=\"data row10 col0\" >La Plata</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_a115a_row11_col0\" class=\"data row11 col0\" >La Rioja</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_a115a_row12_col0\" class=\"data row12 col0\" >Mar del Plata</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_a115a_row13_col0\" class=\"data row13 col0\" >Mendoza</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_a115a_row14_col0\" class=\"data row14 col0\" >Merlo</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_a115a_row15_col0\" class=\"data row15 col0\" >Neuquén</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_a115a_row16_col0\" class=\"data row16 col0\" >Paraná</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_a115a_row17_col0\" class=\"data row17 col0\" >Puerto Madryn</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_a115a_row18_col0\" class=\"data row18 col0\" >Resistencia</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_a115a_row19_col0\" class=\"data row19 col0\" >Rosario</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_a115a_row20_col0\" class=\"data row20 col0\" >Río Gallegos</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_a115a_row21_col0\" class=\"data row21 col0\" >Salta</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_a115a_row22_col0\" class=\"data row22 col0\" >San Fernando</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_a115a_row23_col0\" class=\"data row23 col0\" >San Juan</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_a115a_row24_col0\" class=\"data row24 col0\" >San Luis</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_a115a_row25_col0\" class=\"data row25 col0\" >San Martín de los Andes</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_a115a_row26_col0\" class=\"data row26 col0\" >San Miguel de Tucumán</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_a115a_row27_col0\" class=\"data row27 col0\" >San Rafael</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_a115a_row28_col0\" class=\"data row28 col0\" >San Salvador de Jujuy</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_a115a_row29_col0\" class=\"data row29 col0\" >Santa Fe</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_a115a_row30_col0\" class=\"data row30 col0\" >Santa Rosa</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_a115a_row31_col0\" class=\"data row31 col0\" >Santiago del Estero</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_a115a_row32_col0\" class=\"data row32 col0\" >Ushuaia</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_a115a_row33_col0\" class=\"data row33 col0\" >Viedma</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_a115a_row34_col0\" class=\"data row34 col0\" >Villa Carlos Paz</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n"
      ],
      "text/plain": [
       "<pandas.io.formats.style.Styler at 0x7f21ec8a2050>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "nombre_usuario = input(\"Introduce tu nombre para saber qué lugares nuevos que no visitaste ni tu ni tus amigos: \")\n",
    "\n",
    "query = \"\"\"\n",
    "MATCH (u:Usuario)\n",
    "WHERE toLower(u.nombre) CONTAINS toLower($nombre)\n",
    "MATCH (d:Destino)\n",
    "WHERE \n",
    "  NOT EXISTS { MATCH (d)<-[:VISITO]-(u) } AND\n",
    "  NOT EXISTS { MATCH (d)<-[:VISITO]-(u)-[:AMIGO_DE]-(amigo) }\n",
    "RETURN DISTINCT d.ciudad AS Destinos_No_Visitados\n",
    "ORDER BY d.ciudad\n",
    "\"\"\"\n",
    "\n",
    "print(\"\\n\" + \"-\"*60)\n",
    "print(f\"DESTINOS NUEVOS PARA {nombre_usuario.upper()} Y SUS AMIGOS\")\n",
    "print(\"-\"*60 + \"\\n\")\n",
    "\n",
    "destinos = neo4j.consulta(db_neo4j, query, parametros={\"nombre\": nombre_usuario})\n",
    "\n",
    "if destinos.empty:\n",
    "    print(\"No hay destinos nuevos disponibles.\")\n",
    "else:\n",
    "    # Mostrar cada destino en lista\n",
    "     display(destinos.style.hide(axis=\"index\"))\n",
    "\n",
    "\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "5a7eeb09-de1d-44c0-9a89-07bfc32a6454",
   "metadata": {},
   "source": [
    "### d. Recomendar destinos basados en viajes de amigos."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 58,
   "id": "82f83e03-5562-4eda-8d44-6dd69f5c5426",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "------------------------------------------------------------\n",
      "RECOMENDACIONES PARA JUAN EN FUNCIÓN DE SUS AMIGOS\n",
      "------------------------------------------------------------\n",
      "\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<style type=\"text/css\">\n",
       "</style>\n",
       "<table id=\"T_357ca\">\n",
       "  <thead>\n",
       "    <tr>\n",
       "      <th id=\"T_357ca_level0_col0\" class=\"col_heading level0 col0\" >Destino_Recomendado</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <td id=\"T_357ca_row0_col0\" class=\"data row0 col0\" >Bariloche</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_357ca_row1_col0\" class=\"data row1 col0\" >CABA</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_357ca_row2_col0\" class=\"data row2 col0\" >Chilecito</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_357ca_row3_col0\" class=\"data row3 col0\" >Concordia</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_357ca_row4_col0\" class=\"data row4 col0\" >Corrientes</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_357ca_row5_col0\" class=\"data row5 col0\" >Córdoba</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_357ca_row6_col0\" class=\"data row6 col0\" >El Calafate</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_357ca_row7_col0\" class=\"data row7 col0\" >Formosa</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_357ca_row8_col0\" class=\"data row8 col0\" >Gualeguaychú</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_357ca_row9_col0\" class=\"data row9 col0\" >Iguazú</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_357ca_row10_col0\" class=\"data row10 col0\" >La Plata</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_357ca_row11_col0\" class=\"data row11 col0\" >La Rioja</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_357ca_row12_col0\" class=\"data row12 col0\" >Mar del Plata</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_357ca_row13_col0\" class=\"data row13 col0\" >Mendoza</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_357ca_row14_col0\" class=\"data row14 col0\" >Merlo</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_357ca_row15_col0\" class=\"data row15 col0\" >Neuquén</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_357ca_row16_col0\" class=\"data row16 col0\" >Paraná</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_357ca_row17_col0\" class=\"data row17 col0\" >Puerto Madryn</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_357ca_row18_col0\" class=\"data row18 col0\" >Resistencia</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_357ca_row19_col0\" class=\"data row19 col0\" >Rosario</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_357ca_row20_col0\" class=\"data row20 col0\" >Río Gallegos</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_357ca_row21_col0\" class=\"data row21 col0\" >Salta</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_357ca_row22_col0\" class=\"data row22 col0\" >San Fernando</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_357ca_row23_col0\" class=\"data row23 col0\" >San Juan</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_357ca_row24_col0\" class=\"data row24 col0\" >San Luis</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_357ca_row25_col0\" class=\"data row25 col0\" >San Martín de los Andes</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_357ca_row26_col0\" class=\"data row26 col0\" >San Miguel de Tucumán</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_357ca_row27_col0\" class=\"data row27 col0\" >San Rafael</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_357ca_row28_col0\" class=\"data row28 col0\" >San Salvador de Jujuy</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_357ca_row29_col0\" class=\"data row29 col0\" >Santa Fe</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_357ca_row30_col0\" class=\"data row30 col0\" >Santa Rosa</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_357ca_row31_col0\" class=\"data row31 col0\" >Santiago del Estero</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_357ca_row32_col0\" class=\"data row32 col0\" >Ushuaia</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_357ca_row33_col0\" class=\"data row33 col0\" >Viedma</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n"
      ],
      "text/plain": [
       "<pandas.io.formats.style.Styler at 0x7f21ecac7710>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "nombre_usuario = input(\"Introduce tu nombre para saber qué lugares te recomendamos: \")\n",
    "\n",
    "query = \"\"\"\n",
    "MATCH (u:Usuario)\n",
    "WHERE toLower(u.nombre) CONTAINS toLower($nombre)\n",
    "MATCH (u)-[:AMIGO_DE]-(amigo:Usuario)\n",
    "MATCH (amigo)-[:VISITO]->(d:Destino)\n",
    "WHERE NOT EXISTS { MATCH (u)-[:VISITO]->(d) } \n",
    "RETURN DISTINCT d.ciudad AS Destino_Recomendado\n",
    "ORDER BY d.ciudad\n",
    "\"\"\"\n",
    "\n",
    "print(\"\\n\" + \"-\"*60)\n",
    "print(f\"RECOMENDACIONES PARA {nombre_usuario.upper()} EN FUNCIÓN DE SUS AMIGOS\")\n",
    "print(\"-\"*60 + \"\\n\")\n",
    "\n",
    "destinos = neo4j.consulta(db_neo4j, query, parametros={\"nombre\": nombre_usuario})\n",
    "\n",
    "if destinos.empty:\n",
    "    print(\"No hay destinos recomendados nuevos para vos.\")\n",
    "else:\n",
    "    display(destinos.style.hide(axis=\"index\"))\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "b459bb91-40ed-4088-8e49-e54a16c93371",
   "metadata": {},
   "source": [
    "### e. Listar los hoteles en los destinos recomendados del punto anterior. "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 59,
   "id": "7b7b37ad-b85c-45d9-98db-1b057c13b1d4",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<style type=\"text/css\">\n",
       "</style>\n",
       "<table id=\"T_35f15\">\n",
       "  <thead>\n",
       "    <tr>\n",
       "      <th id=\"T_35f15_level0_col0\" class=\"col_heading level0 col0\" >nombre</th>\n",
       "      <th id=\"T_35f15_level0_col1\" class=\"col_heading level0 col1\" >ciudad</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <td id=\"T_35f15_row0_col0\" class=\"data row0 col0\" >Hermanos Soria S.Coop. Hotel</td>\n",
       "      <td id=\"T_35f15_row0_col1\" class=\"data row0 col1\" >La Plata</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_35f15_row1_col0\" class=\"data row1 col0\" >Espinosa & Asociados S.C.P Hotel</td>\n",
       "      <td id=\"T_35f15_row1_col1\" class=\"data row1 col1\" >La Plata</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_35f15_row2_col0\" class=\"data row2 col0\" >Danilo Bas Pérez S.Coop. Hotel</td>\n",
       "      <td id=\"T_35f15_row2_col1\" class=\"data row2 col1\" >Mar del Plata</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_35f15_row3_col0\" class=\"data row3 col0\" >Grupo Company S.L.L. Hotel</td>\n",
       "      <td id=\"T_35f15_row3_col1\" class=\"data row3 col1\" >Mar del Plata</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_35f15_row4_col0\" class=\"data row4 col0\" >Compañía Hurtado & Asociados S.Coop. Hotel</td>\n",
       "      <td id=\"T_35f15_row4_col1\" class=\"data row4 col1\" >Mar del Plata</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_35f15_row5_col0\" class=\"data row5 col0\" >Gonzalez y Yáñez S.Com. Hotel</td>\n",
       "      <td id=\"T_35f15_row5_col1\" class=\"data row5 col1\" >CABA</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_35f15_row6_col0\" class=\"data row6 col0\" >Manuel Romeu Mayoral S.Coop. Hotel</td>\n",
       "      <td id=\"T_35f15_row6_col1\" class=\"data row6 col1\" >CABA</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_35f15_row7_col0\" class=\"data row7 col0\" >Familia Galiano S.L. Hotel</td>\n",
       "      <td id=\"T_35f15_row7_col1\" class=\"data row7 col1\" >San Fernando</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_35f15_row8_col0\" class=\"data row8 col0\" >Compañía Crespo & Asociados S.A. Hotel</td>\n",
       "      <td id=\"T_35f15_row8_col1\" class=\"data row8 col1\" >San Fernando</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_35f15_row9_col0\" class=\"data row9 col0\" >Distribuciones VJ S.Coop. Hotel</td>\n",
       "      <td id=\"T_35f15_row9_col1\" class=\"data row9 col1\" >San Fernando</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_35f15_row10_col0\" class=\"data row10 col0\" >Grupo Maldonado S.L. Hotel</td>\n",
       "      <td id=\"T_35f15_row10_col1\" class=\"data row10 col1\" >San Fernando</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_35f15_row11_col0\" class=\"data row11 col0\" >Calisto Guillen Lamas S.L. Hotel</td>\n",
       "      <td id=\"T_35f15_row11_col1\" class=\"data row11 col1\" >Resistencia</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_35f15_row12_col0\" class=\"data row12 col0\" >Suministros Españolas S.Coop. Hotel</td>\n",
       "      <td id=\"T_35f15_row12_col1\" class=\"data row12 col1\" >Resistencia</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_35f15_row13_col0\" class=\"data row13 col0\" >Inmobiliaria Cisneros S.A. Hotel</td>\n",
       "      <td id=\"T_35f15_row13_col1\" class=\"data row13 col1\" >Resistencia</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_35f15_row14_col0\" class=\"data row14 col0\" >Inversiones Malo S.Com. Hotel</td>\n",
       "      <td id=\"T_35f15_row14_col1\" class=\"data row14 col1\" >Puerto Madryn</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_35f15_row15_col0\" class=\"data row15 col0\" >Jennifer Mateu Quevedo S.L.N.E Hotel</td>\n",
       "      <td id=\"T_35f15_row15_col1\" class=\"data row15 col1\" >Córdoba</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_35f15_row16_col0\" class=\"data row16 col0\" >Urbano Bernat Ariño S.L.N.E Hotel</td>\n",
       "      <td id=\"T_35f15_row16_col1\" class=\"data row16 col1\" >Córdoba</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_35f15_row17_col0\" class=\"data row17 col0\" >Ibáñez & Asociados S.A. Hotel</td>\n",
       "      <td id=\"T_35f15_row17_col1\" class=\"data row17 col1\" >Córdoba</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_35f15_row18_col0\" class=\"data row18 col0\" >Hermanos Arjona S.L. Hotel</td>\n",
       "      <td id=\"T_35f15_row18_col1\" class=\"data row18 col1\" >Córdoba</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_35f15_row19_col0\" class=\"data row19 col0\" >Tecnologías Villena S.L. Hotel</td>\n",
       "      <td id=\"T_35f15_row19_col1\" class=\"data row19 col1\" >Córdoba</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_35f15_row20_col0\" class=\"data row20 col0\" >Inmobiliaria Globales S.L.N.E Hotel</td>\n",
       "      <td id=\"T_35f15_row20_col1\" class=\"data row20 col1\" >Corrientes</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_35f15_row21_col0\" class=\"data row21 col0\" >Silvia Tormo Carrión S.A. Hotel</td>\n",
       "      <td id=\"T_35f15_row21_col1\" class=\"data row21 col1\" >Corrientes</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_35f15_row22_col0\" class=\"data row22 col0\" >Distribuciones Inteligentes S.Coop. Hotel</td>\n",
       "      <td id=\"T_35f15_row22_col1\" class=\"data row22 col1\" >Paraná</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_35f15_row23_col0\" class=\"data row23 col0\" >Buendía y Gomila S.L.U. Hotel</td>\n",
       "      <td id=\"T_35f15_row23_col1\" class=\"data row23 col1\" >Paraná</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_35f15_row24_col0\" class=\"data row24 col0\" >Talleres HI S.L.N.E Hotel</td>\n",
       "      <td id=\"T_35f15_row24_col1\" class=\"data row24 col1\" >Paraná</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_35f15_row25_col0\" class=\"data row25 col0\" >Inmobiliaria Ribes y asociados S.L.U. Hotel</td>\n",
       "      <td id=\"T_35f15_row25_col1\" class=\"data row25 col1\" >Paraná</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_35f15_row26_col0\" class=\"data row26 col0\" >Talleres Globales S.Com. Hotel</td>\n",
       "      <td id=\"T_35f15_row26_col1\" class=\"data row26 col1\" >Paraná</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_35f15_row27_col0\" class=\"data row27 col0\" >Comercializadora Llorente S.L. Hotel</td>\n",
       "      <td id=\"T_35f15_row27_col1\" class=\"data row27 col1\" >Concordia</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_35f15_row28_col0\" class=\"data row28 col0\" >Nieto y Vera S.C.P Hotel</td>\n",
       "      <td id=\"T_35f15_row28_col1\" class=\"data row28 col1\" >Concordia</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_35f15_row29_col0\" class=\"data row29 col0\" >Hermanos Martín S.L.L. Hotel</td>\n",
       "      <td id=\"T_35f15_row29_col1\" class=\"data row29 col1\" >Concordia</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_35f15_row30_col0\" class=\"data row30 col0\" >Rosenda Comas Salom S.Coop. Hotel</td>\n",
       "      <td id=\"T_35f15_row30_col1\" class=\"data row30 col1\" >Gualeguaychú</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_35f15_row31_col0\" class=\"data row31 col0\" >Márquez y asociados S.Coop. Hotel</td>\n",
       "      <td id=\"T_35f15_row31_col1\" class=\"data row31 col1\" >Gualeguaychú</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_35f15_row32_col0\" class=\"data row32 col0\" >Fabregat & Asociados S.Coop. Hotel</td>\n",
       "      <td id=\"T_35f15_row32_col1\" class=\"data row32 col1\" >Gualeguaychú</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_35f15_row33_col0\" class=\"data row33 col0\" >Soluciones Castellana S.Com. Hotel</td>\n",
       "      <td id=\"T_35f15_row33_col1\" class=\"data row33 col1\" >Gualeguaychú</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_35f15_row34_col0\" class=\"data row34 col0\" >Julieta Piquer Polo S.L.U. Hotel</td>\n",
       "      <td id=\"T_35f15_row34_col1\" class=\"data row34 col1\" >Gualeguaychú</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_35f15_row35_col0\" class=\"data row35 col0\" >Transportes Arco S.A. Hotel</td>\n",
       "      <td id=\"T_35f15_row35_col1\" class=\"data row35 col1\" >Formosa</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_35f15_row36_col0\" class=\"data row36 col0\" >Cabrera y asociados S.A. Hotel</td>\n",
       "      <td id=\"T_35f15_row36_col1\" class=\"data row36 col1\" >Formosa</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_35f15_row37_col0\" class=\"data row37 col0\" >Albino Cobos Redondo S.L.N.E Hotel</td>\n",
       "      <td id=\"T_35f15_row37_col1\" class=\"data row37 col1\" >Formosa</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_35f15_row38_col0\" class=\"data row38 col0\" >Comercializadora Soria S.L. Hotel</td>\n",
       "      <td id=\"T_35f15_row38_col1\" class=\"data row38 col1\" >San Salvador de Jujuy</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_35f15_row39_col0\" class=\"data row39 col0\" >Manufacturas Puga & Asociados S.L.L. Hotel</td>\n",
       "      <td id=\"T_35f15_row39_col1\" class=\"data row39 col1\" >San Salvador de Jujuy</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_35f15_row40_col0\" class=\"data row40 col0\" >Moliner y Torrents S.L.N.E Hotel</td>\n",
       "      <td id=\"T_35f15_row40_col1\" class=\"data row40 col1\" >San Salvador de Jujuy</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_35f15_row41_col0\" class=\"data row41 col0\" >Familia Guitart S.L. Hotel</td>\n",
       "      <td id=\"T_35f15_row41_col1\" class=\"data row41 col1\" >San Salvador de Jujuy</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_35f15_row42_col0\" class=\"data row42 col0\" >Hotel Botella y asociados S.L.U. Hotel</td>\n",
       "      <td id=\"T_35f15_row42_col1\" class=\"data row42 col1\" >San Salvador de Jujuy</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_35f15_row43_col0\" class=\"data row43 col0\" >Supermercados KU S.A. Hotel</td>\n",
       "      <td id=\"T_35f15_row43_col1\" class=\"data row43 col1\" >Santa Rosa</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_35f15_row44_col0\" class=\"data row44 col0\" >Hermanos Palmer S.Com. Hotel</td>\n",
       "      <td id=\"T_35f15_row44_col1\" class=\"data row44 col1\" >Santa Rosa</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_35f15_row45_col0\" class=\"data row45 col0\" >Industrias Requena S.Coop. Hotel</td>\n",
       "      <td id=\"T_35f15_row45_col1\" class=\"data row45 col1\" >La Rioja</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_35f15_row46_col0\" class=\"data row46 col0\" >Distribuciones Díez S.A. Hotel</td>\n",
       "      <td id=\"T_35f15_row46_col1\" class=\"data row46 col1\" >Chilecito</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_35f15_row47_col0\" class=\"data row47 col0\" >Hernando y Valenciano S.L.N.E Hotel</td>\n",
       "      <td id=\"T_35f15_row47_col1\" class=\"data row47 col1\" >Chilecito</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_35f15_row48_col0\" class=\"data row48 col0\" >Hotel Serra S.L. Hotel</td>\n",
       "      <td id=\"T_35f15_row48_col1\" class=\"data row48 col1\" >Chilecito</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_35f15_row49_col0\" class=\"data row49 col0\" >José Mari Agustí Sola S.L.N.E Hotel</td>\n",
       "      <td id=\"T_35f15_row49_col1\" class=\"data row49 col1\" >Chilecito</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_35f15_row50_col0\" class=\"data row50 col0\" >Comercializadora Sala S.L.N.E Hotel</td>\n",
       "      <td id=\"T_35f15_row50_col1\" class=\"data row50 col1\" >Mendoza</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_35f15_row51_col0\" class=\"data row51 col0\" >Suministros Ibáñez y asociados S.L.L. Hotel</td>\n",
       "      <td id=\"T_35f15_row51_col1\" class=\"data row51 col1\" >Mendoza</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_35f15_row52_col0\" class=\"data row52 col0\" >Restauración del Sur S.A. Hotel</td>\n",
       "      <td id=\"T_35f15_row52_col1\" class=\"data row52 col1\" >San Rafael</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_35f15_row53_col0\" class=\"data row53 col0\" >Palomar y Marqués S.L.U. Hotel</td>\n",
       "      <td id=\"T_35f15_row53_col1\" class=\"data row53 col1\" >San Rafael</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_35f15_row54_col0\" class=\"data row54 col0\" >Banca Privada Priego y asociados S.A. Hotel</td>\n",
       "      <td id=\"T_35f15_row54_col1\" class=\"data row54 col1\" >San Rafael</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_35f15_row55_col0\" class=\"data row55 col0\" >Valls y asociados S.L.L. Hotel</td>\n",
       "      <td id=\"T_35f15_row55_col1\" class=\"data row55 col1\" >Iguazú</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_35f15_row56_col0\" class=\"data row56 col0\" >Tecnologías Marquez y asociados S.L. Hotel</td>\n",
       "      <td id=\"T_35f15_row56_col1\" class=\"data row56 col1\" >Iguazú</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_35f15_row57_col0\" class=\"data row57 col0\" >Carlos Chico Gonzalez S.L.L. Hotel</td>\n",
       "      <td id=\"T_35f15_row57_col1\" class=\"data row57 col1\" >Neuquén</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_35f15_row58_col0\" class=\"data row58 col0\" >Paz y Bosch S.L. Hotel</td>\n",
       "      <td id=\"T_35f15_row58_col1\" class=\"data row58 col1\" >Neuquén</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_35f15_row59_col0\" class=\"data row59 col0\" >Hermanos Casals S.Coop. Hotel</td>\n",
       "      <td id=\"T_35f15_row59_col1\" class=\"data row59 col1\" >Neuquén</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_35f15_row60_col0\" class=\"data row60 col0\" >Restauración Pera & Asociados S.L. Hotel</td>\n",
       "      <td id=\"T_35f15_row60_col1\" class=\"data row60 col1\" >Neuquén</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_35f15_row61_col0\" class=\"data row61 col0\" >Amador Mosquera Giralt S.L. Hotel</td>\n",
       "      <td id=\"T_35f15_row61_col1\" class=\"data row61 col1\" >Neuquén</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_35f15_row62_col0\" class=\"data row62 col0\" >Virginia Matas Real S.A. Hotel</td>\n",
       "      <td id=\"T_35f15_row62_col1\" class=\"data row62 col1\" >San Martín de los Andes</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_35f15_row63_col0\" class=\"data row63 col0\" >Familia Mayo S.L.U. Hotel</td>\n",
       "      <td id=\"T_35f15_row63_col1\" class=\"data row63 col1\" >San Martín de los Andes</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_35f15_row64_col0\" class=\"data row64 col0\" >Construcción UH S.Coop. Hotel</td>\n",
       "      <td id=\"T_35f15_row64_col1\" class=\"data row64 col1\" >San Martín de los Andes</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_35f15_row65_col0\" class=\"data row65 col0\" >Cortes y Ribera S.L. Hotel</td>\n",
       "      <td id=\"T_35f15_row65_col1\" class=\"data row65 col1\" >San Martín de los Andes</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_35f15_row66_col0\" class=\"data row66 col0\" >Encarnación Raya Losa S.A. Hotel</td>\n",
       "      <td id=\"T_35f15_row66_col1\" class=\"data row66 col1\" >San Martín de los Andes</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_35f15_row67_col0\" class=\"data row67 col0\" >Gaya y asociados S.Com. Hotel</td>\n",
       "      <td id=\"T_35f15_row67_col1\" class=\"data row67 col1\" >Bariloche</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_35f15_row68_col0\" class=\"data row68 col0\" >Promociones Españolas S.L.U. Hotel</td>\n",
       "      <td id=\"T_35f15_row68_col1\" class=\"data row68 col1\" >Bariloche</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_35f15_row69_col0\" class=\"data row69 col0\" >Palmer & Asociados S.Com. Hotel</td>\n",
       "      <td id=\"T_35f15_row69_col1\" class=\"data row69 col1\" >Bariloche</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_35f15_row70_col0\" class=\"data row70 col0\" >Consultoría del Norte S.A. Hotel</td>\n",
       "      <td id=\"T_35f15_row70_col1\" class=\"data row70 col1\" >Bariloche</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_35f15_row71_col0\" class=\"data row71 col0\" >Banca Privada Castellana S.L. Hotel</td>\n",
       "      <td id=\"T_35f15_row71_col1\" class=\"data row71 col1\" >Bariloche</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_35f15_row72_col0\" class=\"data row72 col0\" >Desarrollo Ibérica S.A. Hotel</td>\n",
       "      <td id=\"T_35f15_row72_col1\" class=\"data row72 col1\" >Viedma</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_35f15_row73_col0\" class=\"data row73 col0\" >Fábrica Ibéricos S.Com. Hotel</td>\n",
       "      <td id=\"T_35f15_row73_col1\" class=\"data row73 col1\" >Viedma</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_35f15_row74_col0\" class=\"data row74 col0\" >Alimentación Lluch S.L.L. Hotel</td>\n",
       "      <td id=\"T_35f15_row74_col1\" class=\"data row74 col1\" >Viedma</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_35f15_row75_col0\" class=\"data row75 col0\" >Desarrollo Iglesia S.L. Hotel</td>\n",
       "      <td id=\"T_35f15_row75_col1\" class=\"data row75 col1\" >Viedma</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_35f15_row76_col0\" class=\"data row76 col0\" >Banca Privada AP S.A.U Hotel</td>\n",
       "      <td id=\"T_35f15_row76_col1\" class=\"data row76 col1\" >Salta</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_35f15_row77_col0\" class=\"data row77 col0\" >Alcázar & Asociados S.C.P Hotel</td>\n",
       "      <td id=\"T_35f15_row77_col1\" class=\"data row77 col1\" >Salta</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_35f15_row78_col0\" class=\"data row78 col0\" >Soluciones Zorrilla S.A. Hotel</td>\n",
       "      <td id=\"T_35f15_row78_col1\" class=\"data row78 col1\" >Salta</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_35f15_row79_col0\" class=\"data row79 col0\" >Tecnologías OAF S.Coop. Hotel</td>\n",
       "      <td id=\"T_35f15_row79_col1\" class=\"data row79 col1\" >Salta</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_35f15_row80_col0\" class=\"data row80 col0\" >Hermanos Sedano S.L. Hotel</td>\n",
       "      <td id=\"T_35f15_row80_col1\" class=\"data row80 col1\" >San Juan</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_35f15_row81_col0\" class=\"data row81 col0\" >Familia Tejero S.L.L. Hotel</td>\n",
       "      <td id=\"T_35f15_row81_col1\" class=\"data row81 col1\" >San Juan</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_35f15_row82_col0\" class=\"data row82 col0\" >Campoy y Trujillo S.L. Hotel</td>\n",
       "      <td id=\"T_35f15_row82_col1\" class=\"data row82 col1\" >San Juan</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_35f15_row83_col0\" class=\"data row83 col0\" >Candelario Berrocal Montserrat S.Coop. Hotel</td>\n",
       "      <td id=\"T_35f15_row83_col1\" class=\"data row83 col1\" >San Luis</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_35f15_row84_col0\" class=\"data row84 col0\" >Desarrollo GEL S.Com. Hotel</td>\n",
       "      <td id=\"T_35f15_row84_col1\" class=\"data row84 col1\" >Merlo</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_35f15_row85_col0\" class=\"data row85 col0\" >Talleres Vega y asociados S.A. Hotel</td>\n",
       "      <td id=\"T_35f15_row85_col1\" class=\"data row85 col1\" >Río Gallegos</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_35f15_row86_col0\" class=\"data row86 col0\" >Fábrica XLR S.Coop. Hotel</td>\n",
       "      <td id=\"T_35f15_row86_col1\" class=\"data row86 col1\" >Río Gallegos</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_35f15_row87_col0\" class=\"data row87 col0\" >Bustamante y Milla S.Com. Hotel</td>\n",
       "      <td id=\"T_35f15_row87_col1\" class=\"data row87 col1\" >El Calafate</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_35f15_row88_col0\" class=\"data row88 col0\" >Promociones Corominas y asociados S.A. Hotel</td>\n",
       "      <td id=\"T_35f15_row88_col1\" class=\"data row88 col1\" >El Calafate</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_35f15_row89_col0\" class=\"data row89 col0\" >Compañía FMQ S.Coop. Hotel</td>\n",
       "      <td id=\"T_35f15_row89_col1\" class=\"data row89 col1\" >El Calafate</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_35f15_row90_col0\" class=\"data row90 col0\" >Carvajal y asociados S.Com. Hotel</td>\n",
       "      <td id=\"T_35f15_row90_col1\" class=\"data row90 col1\" >El Calafate</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_35f15_row91_col0\" class=\"data row91 col0\" >Aznar y Maestre S.Coop. Hotel</td>\n",
       "      <td id=\"T_35f15_row91_col1\" class=\"data row91 col1\" >Rosario</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_35f15_row92_col0\" class=\"data row92 col0\" >Calleja & Asociados S.A. Hotel</td>\n",
       "      <td id=\"T_35f15_row92_col1\" class=\"data row92 col1\" >Rosario</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_35f15_row93_col0\" class=\"data row93 col0\" >Jacobo Campoy Ordóñez S.L.L. Hotel</td>\n",
       "      <td id=\"T_35f15_row93_col1\" class=\"data row93 col1\" >Rosario</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_35f15_row94_col0\" class=\"data row94 col0\" >Cardona y asociados S.Coop. Hotel</td>\n",
       "      <td id=\"T_35f15_row94_col1\" class=\"data row94 col1\" >Rosario</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_35f15_row95_col0\" class=\"data row95 col0\" >Amo y Lastra S.A. Hotel</td>\n",
       "      <td id=\"T_35f15_row95_col1\" class=\"data row95 col1\" >Santa Fe</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_35f15_row96_col0\" class=\"data row96 col0\" >Inversiones Nicolás y asociados S.A. Hotel</td>\n",
       "      <td id=\"T_35f15_row96_col1\" class=\"data row96 col1\" >Santa Fe</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_35f15_row97_col0\" class=\"data row97 col0\" >Servicios Baños S.A. Hotel</td>\n",
       "      <td id=\"T_35f15_row97_col1\" class=\"data row97 col1\" >Santa Fe</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_35f15_row98_col0\" class=\"data row98 col0\" >Familia Garrido S.Com. Hotel</td>\n",
       "      <td id=\"T_35f15_row98_col1\" class=\"data row98 col1\" >Santa Fe</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_35f15_row99_col0\" class=\"data row99 col0\" >Néstor Criado Pelayo S.Com. Hotel</td>\n",
       "      <td id=\"T_35f15_row99_col1\" class=\"data row99 col1\" >Santiago del Estero</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_35f15_row100_col0\" class=\"data row100 col0\" >Blazquez & Asociados S.A. Hotel</td>\n",
       "      <td id=\"T_35f15_row100_col1\" class=\"data row100 col1\" >Santiago del Estero</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_35f15_row101_col0\" class=\"data row101 col0\" >Familia Lladó S.Com. Hotel</td>\n",
       "      <td id=\"T_35f15_row101_col1\" class=\"data row101 col1\" >Santiago del Estero</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_35f15_row102_col0\" class=\"data row102 col0\" >Torralba y Salamanca S.Com. Hotel</td>\n",
       "      <td id=\"T_35f15_row102_col1\" class=\"data row102 col1\" >Santiago del Estero</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_35f15_row103_col0\" class=\"data row103 col0\" >Consultoría del Levante S.Com. Hotel</td>\n",
       "      <td id=\"T_35f15_row103_col1\" class=\"data row103 col1\" >Ushuaia</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_35f15_row104_col0\" class=\"data row104 col0\" >Transportes Águila y asociados S.A. Hotel</td>\n",
       "      <td id=\"T_35f15_row104_col1\" class=\"data row104 col1\" >San Miguel de Tucumán</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_35f15_row105_col0\" class=\"data row105 col0\" >Ballesteros y Aguilera S.A.D Hotel</td>\n",
       "      <td id=\"T_35f15_row105_col1\" class=\"data row105 col1\" >San Miguel de Tucumán</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n"
      ],
      "text/plain": [
       "<pandas.io.formats.style.Styler at 0x7f21fdd12cd0>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "nombre_base = \"clase\"\n",
    "coleccion = \"hoteles\"\n",
    "\n",
    "# Lista de destinos recomendados\n",
    "lista_destinos = destinos[\"Destino_Recomendado\"].dropna().unique().tolist()\n",
    "\n",
    "if not lista_destinos:\n",
    "    print(\"No hay destinos recomendados disponibles.\")\n",
    "else:\n",
    "    filtro = {\"ciudad\": {\"$in\": lista_destinos}}\n",
    "    proyeccion = {\"_id\": 0, \"nombre\": 1, \"ciudad\": 1, \"direccion\": 1}\n",
    "\n",
    "    # Obtener datos de Mongo y convertir a DataFrame\n",
    "    cursor = mongo.obtener_cursor(\n",
    "        nombre_base=nombre_base,\n",
    "        nombre_coleccion=coleccion,\n",
    "        filtro=filtro,\n",
    "        proyeccion=proyeccion\n",
    "    )\n",
    "\n",
    "    hoteles = pd.DataFrame(list(cursor))\n",
    "\n",
    "    if hoteles.empty:\n",
    "        print(\"No se encontraron hoteles en los destinos recomendados.\")\n",
    "    else:\n",
    "        # Ordenar por ciudad y luego por nombre de hotel\n",
    "        display(hoteles.style.hide(axis=\"index\"))\n",
    "       \n",
    "\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "cd981b85-6d94-498b-ab79-0199ac50e662",
   "metadata": {},
   "source": [
    "### f. Ver las reservas en proceso, es decir que aún no están concretadas. "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 60,
   "id": "1a5b2b66-fbc3-4027-a5eb-205fbf8f94cc",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Cantidad de reservas en proceso 408\n",
      "\n",
      "Se imprimen las primeras 2:\n",
      "reserva_temp:1469: {'usuario_id': '17', 'destino_id': '25', 'fecha_reserva': '2025-08-15', 'precio_total': '130733'} | TTL: 3535 segundos\n",
      "reserva_temp:1386: {'usuario_id': '58', 'destino_id': '24', 'fecha_reserva': '2025-04-10', 'precio_total': '67092'} | TTL: 3535 segundos\n"
     ]
    }
   ],
   "source": [
    "claves = db_redis.keys(\"reserva_temp:*\")\n",
    "print(f\"Cantidad de reservas en proceso {len(claves)}\\n\")\n",
    "\n",
    "if claves:\n",
    "    cantidad = int(input (\"¿Cuántas se desean listar?\"))\n",
    "    print(f\"Se imprimen las primeras {cantidad}:\")\n",
    "    for clave in claves[:cantidad]:\n",
    "        datos = db_redis.hgetall(clave)\n",
    "        tiempo_restante = db_redis.ttl(clave)\n",
    "        print(f\"{clave}: {datos} | TTL: {tiempo_restante} segundos\")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "ade67b15-bc20-439d-99a8-1eeb0b039311",
   "metadata": {},
   "source": [
    "### g. Listar los usuarios conectados actualmente. "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 61,
   "id": "27ad781f-fa03-4f5f-bb8d-11e15a652d20",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Cantidad de usuarios conectados 15\n",
      "\n",
      "Usuarios:\n",
      "Usuario 37 → sesión: activa | TTL: 3509 segundos\n",
      "Usuario 49 → sesión: activa | TTL: 3509 segundos\n",
      "Usuario 1 → sesión: activa | TTL: 3509 segundos\n",
      "Usuario 32 → sesión: activa | TTL: 3509 segundos\n",
      "Usuario 53 → sesión: activa | TTL: 3509 segundos\n",
      "Usuario 34 → sesión: activa | TTL: 3509 segundos\n",
      "Usuario 55 → sesión: activa | TTL: 3509 segundos\n",
      "Usuario 4 → sesión: activa | TTL: 3509 segundos\n",
      "Usuario 51 → sesión: activa | TTL: 3509 segundos\n",
      "Usuario 14 → sesión: activa | TTL: 3509 segundos\n",
      "Usuario 46 → sesión: activa | TTL: 3509 segundos\n",
      "Usuario 6 → sesión: activa | TTL: 3509 segundos\n",
      "Usuario 58 → sesión: activa | TTL: 3509 segundos\n",
      "Usuario 13 → sesión: activa | TTL: 3509 segundos\n",
      "Usuario 47 → sesión: activa | TTL: 3509 segundos\n"
     ]
    }
   ],
   "source": [
    "claves = db_redis.keys(\"usuario:*:sesion\")\n",
    "print(f\"Cantidad de usuarios conectados {len(claves)}\\n\")\n",
    "\n",
    "if claves:\n",
    "    print(\"Usuarios:\")\n",
    "    for clave in claves:\n",
    "        usuario_id = clave.split(\":\")[1]\n",
    "        estado = db_redis.get(clave)\n",
    "        tiempo_restante = db_redis.ttl(clave)\n",
    "        print(f\"Usuario {usuario_id} → sesión: {estado} | TTL: {tiempo_restante} segundos\")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "e7c3ca0e-27f8-4994-884a-862a2c7ddad2",
   "metadata": {},
   "source": [
    "### h. Mostrar los destinos con precio inferior a $100.000"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 62,
   "id": "c1830ae2-8119-4540-bb8e-53442062bde9",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Consulta hecha en Mongo\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<style type=\"text/css\">\n",
       "</style>\n",
       "<table id=\"T_d2ff9\">\n",
       "  <thead>\n",
       "    <tr>\n",
       "      <th id=\"T_d2ff9_level0_col0\" class=\"col_heading level0 col0\" >destino_id</th>\n",
       "      <th id=\"T_d2ff9_level0_col1\" class=\"col_heading level0 col1\" >provincia</th>\n",
       "      <th id=\"T_d2ff9_level0_col2\" class=\"col_heading level0 col2\" >ciudad</th>\n",
       "      <th id=\"T_d2ff9_level0_col3\" class=\"col_heading level0 col3\" >pais</th>\n",
       "      <th id=\"T_d2ff9_level0_col4\" class=\"col_heading level0 col4\" >tipo</th>\n",
       "      <th id=\"T_d2ff9_level0_col5\" class=\"col_heading level0 col5\" >precio_promedio</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <td id=\"T_d2ff9_row0_col0\" class=\"data row0 col0\" >1</td>\n",
       "      <td id=\"T_d2ff9_row0_col1\" class=\"data row0 col1\" >Buenos Aires</td>\n",
       "      <td id=\"T_d2ff9_row0_col2\" class=\"data row0 col2\" >La Plata</td>\n",
       "      <td id=\"T_d2ff9_row0_col3\" class=\"data row0 col3\" >Argentina</td>\n",
       "      <td id=\"T_d2ff9_row0_col4\" class=\"data row0 col4\" >Cultural</td>\n",
       "      <td id=\"T_d2ff9_row0_col5\" class=\"data row0 col5\" >56556</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_d2ff9_row1_col0\" class=\"data row1 col0\" >3</td>\n",
       "      <td id=\"T_d2ff9_row1_col1\" class=\"data row1 col1\" >Ciudad Autónoma de Buenos Aires</td>\n",
       "      <td id=\"T_d2ff9_row1_col2\" class=\"data row1 col2\" >CABA</td>\n",
       "      <td id=\"T_d2ff9_row1_col3\" class=\"data row1 col3\" >Argentina</td>\n",
       "      <td id=\"T_d2ff9_row1_col4\" class=\"data row1 col4\" >Playa</td>\n",
       "      <td id=\"T_d2ff9_row1_col5\" class=\"data row1 col5\" >86579</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_d2ff9_row2_col0\" class=\"data row2 col0\" >6</td>\n",
       "      <td id=\"T_d2ff9_row2_col1\" class=\"data row2 col1\" >Chubut</td>\n",
       "      <td id=\"T_d2ff9_row2_col2\" class=\"data row2 col2\" >Puerto Madryn</td>\n",
       "      <td id=\"T_d2ff9_row2_col3\" class=\"data row2 col3\" >Argentina</td>\n",
       "      <td id=\"T_d2ff9_row2_col4\" class=\"data row2 col4\" >Cultural</td>\n",
       "      <td id=\"T_d2ff9_row2_col5\" class=\"data row2 col5\" >57811</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_d2ff9_row3_col0\" class=\"data row3 col0\" >9</td>\n",
       "      <td id=\"T_d2ff9_row3_col1\" class=\"data row3 col1\" >Córdoba</td>\n",
       "      <td id=\"T_d2ff9_row3_col2\" class=\"data row3 col2\" >Río Cuarto</td>\n",
       "      <td id=\"T_d2ff9_row3_col3\" class=\"data row3 col3\" >Argentina</td>\n",
       "      <td id=\"T_d2ff9_row3_col4\" class=\"data row3 col4\" >Relax</td>\n",
       "      <td id=\"T_d2ff9_row3_col5\" class=\"data row3 col5\" >56956</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_d2ff9_row4_col0\" class=\"data row4 col0\" >14</td>\n",
       "      <td id=\"T_d2ff9_row4_col1\" class=\"data row4 col1\" >Formosa</td>\n",
       "      <td id=\"T_d2ff9_row4_col2\" class=\"data row4 col2\" >Formosa</td>\n",
       "      <td id=\"T_d2ff9_row4_col3\" class=\"data row4 col3\" >Argentina</td>\n",
       "      <td id=\"T_d2ff9_row4_col4\" class=\"data row4 col4\" >Cultural</td>\n",
       "      <td id=\"T_d2ff9_row4_col5\" class=\"data row4 col5\" >91853</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_d2ff9_row5_col0\" class=\"data row5 col0\" >16</td>\n",
       "      <td id=\"T_d2ff9_row5_col1\" class=\"data row5 col1\" >La Pampa</td>\n",
       "      <td id=\"T_d2ff9_row5_col2\" class=\"data row5 col2\" >Santa Rosa</td>\n",
       "      <td id=\"T_d2ff9_row5_col3\" class=\"data row5 col3\" >Argentina</td>\n",
       "      <td id=\"T_d2ff9_row5_col4\" class=\"data row5 col4\" >Montaña</td>\n",
       "      <td id=\"T_d2ff9_row5_col5\" class=\"data row5 col5\" >90758</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_d2ff9_row6_col0\" class=\"data row6 col0\" >18</td>\n",
       "      <td id=\"T_d2ff9_row6_col1\" class=\"data row6 col1\" >La Rioja</td>\n",
       "      <td id=\"T_d2ff9_row6_col2\" class=\"data row6 col2\" >Chilecito</td>\n",
       "      <td id=\"T_d2ff9_row6_col3\" class=\"data row6 col3\" >Argentina</td>\n",
       "      <td id=\"T_d2ff9_row6_col4\" class=\"data row6 col4\" >Cultural</td>\n",
       "      <td id=\"T_d2ff9_row6_col5\" class=\"data row6 col5\" >74312</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_d2ff9_row7_col0\" class=\"data row7 col0\" >19</td>\n",
       "      <td id=\"T_d2ff9_row7_col1\" class=\"data row7 col1\" >Mendoza</td>\n",
       "      <td id=\"T_d2ff9_row7_col2\" class=\"data row7 col2\" >Mendoza</td>\n",
       "      <td id=\"T_d2ff9_row7_col3\" class=\"data row7 col3\" >Argentina</td>\n",
       "      <td id=\"T_d2ff9_row7_col4\" class=\"data row7 col4\" >Aventura</td>\n",
       "      <td id=\"T_d2ff9_row7_col5\" class=\"data row7 col5\" >75353</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_d2ff9_row8_col0\" class=\"data row8 col0\" >23</td>\n",
       "      <td id=\"T_d2ff9_row8_col1\" class=\"data row8 col1\" >Neuquén</td>\n",
       "      <td id=\"T_d2ff9_row8_col2\" class=\"data row8 col2\" >Neuquén</td>\n",
       "      <td id=\"T_d2ff9_row8_col3\" class=\"data row8 col3\" >Argentina</td>\n",
       "      <td id=\"T_d2ff9_row8_col4\" class=\"data row8 col4\" >Relax</td>\n",
       "      <td id=\"T_d2ff9_row8_col5\" class=\"data row8 col5\" >82722</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_d2ff9_row9_col0\" class=\"data row9 col0\" >24</td>\n",
       "      <td id=\"T_d2ff9_row9_col1\" class=\"data row9 col1\" >Neuquén</td>\n",
       "      <td id=\"T_d2ff9_row9_col2\" class=\"data row9 col2\" >San Martín de los Andes</td>\n",
       "      <td id=\"T_d2ff9_row9_col3\" class=\"data row9 col3\" >Argentina</td>\n",
       "      <td id=\"T_d2ff9_row9_col4\" class=\"data row9 col4\" >Aventura</td>\n",
       "      <td id=\"T_d2ff9_row9_col5\" class=\"data row9 col5\" >70656</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_d2ff9_row10_col0\" class=\"data row10 col0\" >28</td>\n",
       "      <td id=\"T_d2ff9_row10_col1\" class=\"data row10 col1\" >San Juan</td>\n",
       "      <td id=\"T_d2ff9_row10_col2\" class=\"data row10 col2\" >San Juan</td>\n",
       "      <td id=\"T_d2ff9_row10_col3\" class=\"data row10 col3\" >Argentina</td>\n",
       "      <td id=\"T_d2ff9_row10_col4\" class=\"data row10 col4\" >Cultural</td>\n",
       "      <td id=\"T_d2ff9_row10_col5\" class=\"data row10 col5\" >62012</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_d2ff9_row11_col0\" class=\"data row11 col0\" >33</td>\n",
       "      <td id=\"T_d2ff9_row11_col1\" class=\"data row11 col1\" >Santa Fe</td>\n",
       "      <td id=\"T_d2ff9_row11_col2\" class=\"data row11 col2\" >Rosario</td>\n",
       "      <td id=\"T_d2ff9_row11_col3\" class=\"data row11 col3\" >Argentina</td>\n",
       "      <td id=\"T_d2ff9_row11_col4\" class=\"data row11 col4\" >Montaña</td>\n",
       "      <td id=\"T_d2ff9_row11_col5\" class=\"data row11 col5\" >92638</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_d2ff9_row12_col0\" class=\"data row12 col0\" >36</td>\n",
       "      <td id=\"T_d2ff9_row12_col1\" class=\"data row12 col1\" >Tierra del Fuego</td>\n",
       "      <td id=\"T_d2ff9_row12_col2\" class=\"data row12 col2\" >Ushuaia</td>\n",
       "      <td id=\"T_d2ff9_row12_col3\" class=\"data row12 col3\" >Argentina</td>\n",
       "      <td id=\"T_d2ff9_row12_col4\" class=\"data row12 col4\" >Cultural</td>\n",
       "      <td id=\"T_d2ff9_row12_col5\" class=\"data row12 col5\" >94862</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n"
      ],
      "text/plain": [
       "<pandas.io.formats.style.Styler at 0x7f21fc0e3490>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "precio=100000\n",
    "base = \"clase\"\n",
    "coleccion = \"destinos\"\n",
    "filtro={\"precio_promedio\": {\"$lt\": precio}}\n",
    "proyeccion = {\"_id\":0}\n",
    "\n",
    "# Busca en caché y sino consulta en MongoDB\n",
    "resultado = redis.obtener_cache(coleccion, filtro)\n",
    "if resultado is None:\n",
    "    print(\"Consulta hecha en Mongo\")\n",
    "    cursor = mongo.obtener_cursor(base,coleccion,filtro=filtro,proyeccion=proyeccion)\n",
    "    resultado = list(cursor)\n",
    "    if resultado:\n",
    "        redis.guardar_en_cache(coleccion,filtro,resultado,ttl=300)\n",
    "else:\n",
    "    print(\"Consulta hecha en Redis\")\n",
    "        \n",
    "df = pd.DataFrame(resultado)\n",
    "if not df.empty:\n",
    "    df_ordenado = df.sort_values(by=\"destino_id\")\n",
    "    display(df_ordenado.style.hide(axis=\"index\"))\n",
    "else:\n",
    "    print(f\"No existen destinos con precio inferior a {precio}\")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "e9bdc948-d1aa-4cad-a6fa-754f4b8ecc19",
   "metadata": {},
   "source": [
    "## i. Mostrar todos los Hoteles de “Jujuy”."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 63,
   "id": "f9fb2e9a-0b76-4ea0-abdf-ae547e2961a7",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Consulta hecha en Mongo\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<style type=\"text/css\">\n",
       "</style>\n",
       "<table id=\"T_8ed79\">\n",
       "  <thead>\n",
       "    <tr>\n",
       "      <th id=\"T_8ed79_level0_col0\" class=\"col_heading level0 col0\" >nombre</th>\n",
       "      <th id=\"T_8ed79_level0_col1\" class=\"col_heading level0 col1\" >ciudad</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <td id=\"T_8ed79_row0_col0\" class=\"data row0 col0\" >Comercializadora Soria S.L. Hotel</td>\n",
       "      <td id=\"T_8ed79_row0_col1\" class=\"data row0 col1\" >San Salvador de Jujuy</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_8ed79_row1_col0\" class=\"data row1 col0\" >Familia Guitart S.L. Hotel</td>\n",
       "      <td id=\"T_8ed79_row1_col1\" class=\"data row1 col1\" >San Salvador de Jujuy</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_8ed79_row2_col0\" class=\"data row2 col0\" >Hotel Botella y asociados S.L.U. Hotel</td>\n",
       "      <td id=\"T_8ed79_row2_col1\" class=\"data row2 col1\" >San Salvador de Jujuy</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_8ed79_row3_col0\" class=\"data row3 col0\" >Manufacturas Puga & Asociados S.L.L. Hotel</td>\n",
       "      <td id=\"T_8ed79_row3_col1\" class=\"data row3 col1\" >San Salvador de Jujuy</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_8ed79_row4_col0\" class=\"data row4 col0\" >Moliner y Torrents S.L.N.E Hotel</td>\n",
       "      <td id=\"T_8ed79_row4_col1\" class=\"data row4 col1\" >San Salvador de Jujuy</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n"
      ],
      "text/plain": [
       "<pandas.io.formats.style.Styler at 0x7f21ef7709d0>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "nombre_base = \"clase\"\n",
    "coleccion = \"hoteles\"\n",
    "ciudad = \"San Salvador de Jujuy\"\n",
    "filtro = {\"ciudad\": ciudad}\n",
    "proyeccion = {\"_id\": 0, \"nombre\": 1, \"ciudad\": 1, \"direccion\": 1}\n",
    "\n",
    "# Busca en caché y sino consulta en MongoDB\n",
    "resultado = redis.obtener_cache(coleccion, filtro)\n",
    "if resultado is None:\n",
    "    print(\"Consulta hecha en Mongo\")\n",
    "    cursor = mongo.obtener_cursor(nombre_base=nombre_base,nombre_coleccion=coleccion,filtro=filtro,proyeccion=proyeccion)\n",
    "    resultado = list(cursor)\n",
    "    if resultado:\n",
    "        redis.guardar_en_cache(coleccion,filtro,resultado,ttl=300)\n",
    "else:\n",
    "    print(\"Consulta hecha en Redis\")\n",
    "\n",
    "df_hoteles = pd.DataFrame(resultado)\n",
    "\n",
    "if not df_hoteles.empty:\n",
    "    df_ordenado = df_hoteles.sort_values(by=\"nombre\")\n",
    "    display(df_ordenado.style.hide(axis=\"index\"))\n",
    "else:\n",
    "     print(\"No se encontraron hoteles en los destinos recomendados.\")       "
   ]
  },
  {
   "cell_type": "markdown",
   "id": "4e826afb-eff6-43c7-9a7f-f501429fadbd",
   "metadata": {},
   "source": [
    "## j. Mostrar la cantidad de hoteles de un destino que guste. "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 64,
   "id": "71f8baa0-c3bd-4566-98cd-6080ebc1f706",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      " Cantidad de hoteles en la ciudad L:\n",
      "\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "Empty DataFrame\n",
       "Columns: []\n",
       "Index: []"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "import pandas as pd\n",
    "\n",
    "# 1️⃣ Pedimos al usuario el tipo de agrupación y el valor a buscar\n",
    "agrupar = input(\"¿Querés agrupar por 'provincia' o 'ciudad'? \").strip().lower()\n",
    "lugar = input(f\"Introduce el nombre de la {agrupar}: \").strip()\n",
    "\n",
    "# 2️⃣ Definimos el filtro dinámico según la elección\n",
    "filtro = {agrupar: lugar}\n",
    "\n",
    "# 3️⃣ Si el usuario elige 'provincia', agrupamos por ciudad dentro de esa provincia\n",
    "if agrupar == \"provincia\":\n",
    "    campo_agrupacion = \"ciudad\"\n",
    "else:\n",
    "    campo_agrupacion = agrupar\n",
    "\n",
    "# 4️⃣ Ejecutamos la función para contar hoteles\n",
    "cursor = mongo.contador(\n",
    "    nombre_base=\"clase\",\n",
    "    coleccion=\"hoteles\",\n",
    "    agrupacion=campo_agrupacion,\n",
    "    campo_calculo=\"hotel_id\",\n",
    "    filtrar=filtro\n",
    ")\n",
    "\n",
    "# 5️⃣ Convertimos el cursor a DataFrame\n",
    "hoteles = pd.DataFrame(cursor)\n",
    "\n",
    "# 6️⃣ Mostramos resultados\n",
    "if agrupar == \"provincia\":\n",
    "    print(f\"\\n📍 Hoteles por ciudad dentro de la provincia {lugar.title()}:\\n\")\n",
    "else:\n",
    "    print(f\"\\n Cantidad de hoteles en la ciudad {lugar.title()}:\\n\")\n",
    "\n",
    "display(hoteles)\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "7bc48eaa-eae9-4c22-9036-ff018d34d4b7",
   "metadata": {},
   "source": [
    "### k. Mostrar las actividades de “Ushuaia” del tipo “aventura”."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 65,
   "id": "0e0cae71-3b60-466b-bcf5-a2dffb71eff3",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Consulta hecha en Mongo\n",
      "No existen actividades de tipo aventura en Ushuaia\n"
     ]
    }
   ],
   "source": [
    "nombre_base = \"clase\"\n",
    "coleccion = \"actividades\"\n",
    "tipo=\"aventura\"\n",
    "ciudad=\"Ushuaia\"\n",
    "filtro = {\"ciudad\":ciudad,\"tipo\":tipo}\n",
    "proyeccion = {\"_id\":0}\n",
    "\n",
    "resultado = redis.obtener_cache(coleccion, filtro)\n",
    "if resultado is None:\n",
    "    cursor = mongo.obtener_cursor(base,coleccion,filtro=filtro,proyeccion=proyeccion)\n",
    "    print(\"Consulta hecha en Mongo\")\n",
    "    resultado = list(cursor)\n",
    "    if resultado:\n",
    "        redis.guardar_en_cache(coleccion,filtro,resultado,ttl=300)\n",
    "else:\n",
    "    print(\"Consulta hecha en Redis\")\n",
    "    \n",
    "df = pd.DataFrame(resultado)\n",
    "if not df.empty:\n",
    "    df_ordenado = df.sort_values(by=\"actividad_id\")\n",
    "    display(df_ordenado.style.hide(axis=\"index\"))\n",
    "else:\n",
    "    print(f\"No existen actividades de tipo {tipo} en {ciudad}\")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "aba91348-5d0a-424b-b2f2-75b506b969b3",
   "metadata": {},
   "source": [
    "### l. Mostrar la cantidad de reservas concretadas de cada usuario. Mostrar el usuario y la cantidad "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 66,
   "id": "bdb34b6e-fe60-481f-b7b4-0f5439906c33",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Consulta hecha en Mongo\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<style type=\"text/css\">\n",
       "</style>\n",
       "<table id=\"T_86d0a\">\n",
       "  <thead>\n",
       "    <tr>\n",
       "      <th id=\"T_86d0a_level0_col0\" class=\"col_heading level0 col0\" >Nombre</th>\n",
       "      <th id=\"T_86d0a_level0_col1\" class=\"col_heading level0 col1\" >Apellido</th>\n",
       "      <th id=\"T_86d0a_level0_col2\" class=\"col_heading level0 col2\" >Reservas_concretadas</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <td id=\"T_86d0a_row0_col0\" class=\"data row0 col0\" >Gracia</td>\n",
       "      <td id=\"T_86d0a_row0_col1\" class=\"data row0 col1\" >Naranjo</td>\n",
       "      <td id=\"T_86d0a_row0_col2\" class=\"data row0 col2\" >24</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_86d0a_row1_col0\" class=\"data row1 col0\" >Carmen</td>\n",
       "      <td id=\"T_86d0a_row1_col1\" class=\"data row1 col1\" >Roma</td>\n",
       "      <td id=\"T_86d0a_row1_col2\" class=\"data row1 col2\" >22</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_86d0a_row2_col0\" class=\"data row2 col0\" >Ovidio</td>\n",
       "      <td id=\"T_86d0a_row2_col1\" class=\"data row2 col1\" >Romero</td>\n",
       "      <td id=\"T_86d0a_row2_col2\" class=\"data row2 col2\" >21</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_86d0a_row3_col0\" class=\"data row3 col0\" >David</td>\n",
       "      <td id=\"T_86d0a_row3_col1\" class=\"data row3 col1\" >Julián</td>\n",
       "      <td id=\"T_86d0a_row3_col2\" class=\"data row3 col2\" >20</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_86d0a_row4_col0\" class=\"data row4 col0\" >Mónica</td>\n",
       "      <td id=\"T_86d0a_row4_col1\" class=\"data row4 col1\" >Roca</td>\n",
       "      <td id=\"T_86d0a_row4_col2\" class=\"data row4 col2\" >20</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_86d0a_row5_col0\" class=\"data row5 col0\" >Georgina</td>\n",
       "      <td id=\"T_86d0a_row5_col1\" class=\"data row5 col1\" >Ferrando</td>\n",
       "      <td id=\"T_86d0a_row5_col2\" class=\"data row5 col2\" >20</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_86d0a_row6_col0\" class=\"data row6 col0\" >Adrián</td>\n",
       "      <td id=\"T_86d0a_row6_col1\" class=\"data row6 col1\" >Belda</td>\n",
       "      <td id=\"T_86d0a_row6_col2\" class=\"data row6 col2\" >19</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_86d0a_row7_col0\" class=\"data row7 col0\" >Eliseo</td>\n",
       "      <td id=\"T_86d0a_row7_col1\" class=\"data row7 col1\" >Sobrino</td>\n",
       "      <td id=\"T_86d0a_row7_col2\" class=\"data row7 col2\" >19</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_86d0a_row8_col0\" class=\"data row8 col0\" >Cleto</td>\n",
       "      <td id=\"T_86d0a_row8_col1\" class=\"data row8 col1\" >Palomar</td>\n",
       "      <td id=\"T_86d0a_row8_col2\" class=\"data row8 col2\" >19</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_86d0a_row9_col0\" class=\"data row9 col0\" >Mercedes</td>\n",
       "      <td id=\"T_86d0a_row9_col1\" class=\"data row9 col1\" >Arjona</td>\n",
       "      <td id=\"T_86d0a_row9_col2\" class=\"data row9 col2\" >18</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_86d0a_row10_col0\" class=\"data row10 col0\" >Gema</td>\n",
       "      <td id=\"T_86d0a_row10_col1\" class=\"data row10 col1\" >Yáñez</td>\n",
       "      <td id=\"T_86d0a_row10_col2\" class=\"data row10 col2\" >18</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_86d0a_row11_col0\" class=\"data row11 col0\" >Coral</td>\n",
       "      <td id=\"T_86d0a_row11_col1\" class=\"data row11 col1\" >Perez</td>\n",
       "      <td id=\"T_86d0a_row11_col2\" class=\"data row11 col2\" >17</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_86d0a_row12_col0\" class=\"data row12 col0\" >Emiliana</td>\n",
       "      <td id=\"T_86d0a_row12_col1\" class=\"data row12 col1\" >Beltran</td>\n",
       "      <td id=\"T_86d0a_row12_col2\" class=\"data row12 col2\" >16</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_86d0a_row13_col0\" class=\"data row13 col0\" >Lucas</td>\n",
       "      <td id=\"T_86d0a_row13_col1\" class=\"data row13 col1\" >Cruz</td>\n",
       "      <td id=\"T_86d0a_row13_col2\" class=\"data row13 col2\" >16</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_86d0a_row14_col0\" class=\"data row14 col0\" >Lino</td>\n",
       "      <td id=\"T_86d0a_row14_col1\" class=\"data row14 col1\" >Llorente</td>\n",
       "      <td id=\"T_86d0a_row14_col2\" class=\"data row14 col2\" >16</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_86d0a_row15_col0\" class=\"data row15 col0\" >Poncio</td>\n",
       "      <td id=\"T_86d0a_row15_col1\" class=\"data row15 col1\" >Escobar</td>\n",
       "      <td id=\"T_86d0a_row15_col2\" class=\"data row15 col2\" >16</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_86d0a_row16_col0\" class=\"data row16 col0\" >Roque</td>\n",
       "      <td id=\"T_86d0a_row16_col1\" class=\"data row16 col1\" >Navarrete</td>\n",
       "      <td id=\"T_86d0a_row16_col2\" class=\"data row16 col2\" >16</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_86d0a_row17_col0\" class=\"data row17 col0\" >Óscar</td>\n",
       "      <td id=\"T_86d0a_row17_col1\" class=\"data row17 col1\" >Pino</td>\n",
       "      <td id=\"T_86d0a_row17_col2\" class=\"data row17 col2\" >16</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_86d0a_row18_col0\" class=\"data row18 col0\" >Wilfredo</td>\n",
       "      <td id=\"T_86d0a_row18_col1\" class=\"data row18 col1\" >Patiño</td>\n",
       "      <td id=\"T_86d0a_row18_col2\" class=\"data row18 col2\" >16</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_86d0a_row19_col0\" class=\"data row19 col0\" >Calista</td>\n",
       "      <td id=\"T_86d0a_row19_col1\" class=\"data row19 col1\" >Catalán</td>\n",
       "      <td id=\"T_86d0a_row19_col2\" class=\"data row19 col2\" >15</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_86d0a_row20_col0\" class=\"data row20 col0\" >Omar</td>\n",
       "      <td id=\"T_86d0a_row20_col1\" class=\"data row20 col1\" >Roig</td>\n",
       "      <td id=\"T_86d0a_row20_col2\" class=\"data row20 col2\" >15</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_86d0a_row21_col0\" class=\"data row21 col0\" >Leopoldo</td>\n",
       "      <td id=\"T_86d0a_row21_col1\" class=\"data row21 col1\" >Agudo</td>\n",
       "      <td id=\"T_86d0a_row21_col2\" class=\"data row21 col2\" >15</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_86d0a_row22_col0\" class=\"data row22 col0\" >Juan José</td>\n",
       "      <td id=\"T_86d0a_row22_col1\" class=\"data row22 col1\" >Romero</td>\n",
       "      <td id=\"T_86d0a_row22_col2\" class=\"data row22 col2\" >15</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_86d0a_row23_col0\" class=\"data row23 col0\" >Fernanda</td>\n",
       "      <td id=\"T_86d0a_row23_col1\" class=\"data row23 col1\" >Romero</td>\n",
       "      <td id=\"T_86d0a_row23_col2\" class=\"data row23 col2\" >14</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_86d0a_row24_col0\" class=\"data row24 col0\" >Tito</td>\n",
       "      <td id=\"T_86d0a_row24_col1\" class=\"data row24 col1\" >Montserrat</td>\n",
       "      <td id=\"T_86d0a_row24_col2\" class=\"data row24 col2\" >14</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_86d0a_row25_col0\" class=\"data row25 col0\" >Juan Manuel</td>\n",
       "      <td id=\"T_86d0a_row25_col1\" class=\"data row25 col1\" >Sanz</td>\n",
       "      <td id=\"T_86d0a_row25_col2\" class=\"data row25 col2\" >14</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_86d0a_row26_col0\" class=\"data row26 col0\" >Feliciano</td>\n",
       "      <td id=\"T_86d0a_row26_col1\" class=\"data row26 col1\" >Campoy</td>\n",
       "      <td id=\"T_86d0a_row26_col2\" class=\"data row26 col2\" >14</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_86d0a_row27_col0\" class=\"data row27 col0\" >Maricela</td>\n",
       "      <td id=\"T_86d0a_row27_col1\" class=\"data row27 col1\" >Lasa</td>\n",
       "      <td id=\"T_86d0a_row27_col2\" class=\"data row27 col2\" >14</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_86d0a_row28_col0\" class=\"data row28 col0\" >Juan Antonio</td>\n",
       "      <td id=\"T_86d0a_row28_col1\" class=\"data row28 col1\" >Huertas</td>\n",
       "      <td id=\"T_86d0a_row28_col2\" class=\"data row28 col2\" >14</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_86d0a_row29_col0\" class=\"data row29 col0\" >Agapito</td>\n",
       "      <td id=\"T_86d0a_row29_col1\" class=\"data row29 col1\" >Sedano</td>\n",
       "      <td id=\"T_86d0a_row29_col2\" class=\"data row29 col2\" >14</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_86d0a_row30_col0\" class=\"data row30 col0\" >Nicolás</td>\n",
       "      <td id=\"T_86d0a_row30_col1\" class=\"data row30 col1\" >Pinilla</td>\n",
       "      <td id=\"T_86d0a_row30_col2\" class=\"data row30 col2\" >14</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_86d0a_row31_col0\" class=\"data row31 col0\" >Tito</td>\n",
       "      <td id=\"T_86d0a_row31_col1\" class=\"data row31 col1\" >Castell</td>\n",
       "      <td id=\"T_86d0a_row31_col2\" class=\"data row31 col2\" >14</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_86d0a_row32_col0\" class=\"data row32 col0\" >Blas</td>\n",
       "      <td id=\"T_86d0a_row32_col1\" class=\"data row32 col1\" >Galván</td>\n",
       "      <td id=\"T_86d0a_row32_col2\" class=\"data row32 col2\" >14</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_86d0a_row33_col0\" class=\"data row33 col0\" >Graciana</td>\n",
       "      <td id=\"T_86d0a_row33_col1\" class=\"data row33 col1\" >Murillo</td>\n",
       "      <td id=\"T_86d0a_row33_col2\" class=\"data row33 col2\" >13</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_86d0a_row34_col0\" class=\"data row34 col0\" >Nico</td>\n",
       "      <td id=\"T_86d0a_row34_col1\" class=\"data row34 col1\" >Montenegro</td>\n",
       "      <td id=\"T_86d0a_row34_col2\" class=\"data row34 col2\" >13</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_86d0a_row35_col0\" class=\"data row35 col0\" >Teodora</td>\n",
       "      <td id=\"T_86d0a_row35_col1\" class=\"data row35 col1\" >Campillo</td>\n",
       "      <td id=\"T_86d0a_row35_col2\" class=\"data row35 col2\" >13</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_86d0a_row36_col0\" class=\"data row36 col0\" >Urbano</td>\n",
       "      <td id=\"T_86d0a_row36_col1\" class=\"data row36 col1\" >Villar</td>\n",
       "      <td id=\"T_86d0a_row36_col2\" class=\"data row36 col2\" >13</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_86d0a_row37_col0\" class=\"data row37 col0\" >Enrique</td>\n",
       "      <td id=\"T_86d0a_row37_col1\" class=\"data row37 col1\" >Roca</td>\n",
       "      <td id=\"T_86d0a_row37_col2\" class=\"data row37 col2\" >13</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_86d0a_row38_col0\" class=\"data row38 col0\" >Gregorio</td>\n",
       "      <td id=\"T_86d0a_row38_col1\" class=\"data row38 col1\" >Rivero</td>\n",
       "      <td id=\"T_86d0a_row38_col2\" class=\"data row38 col2\" >13</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_86d0a_row39_col0\" class=\"data row39 col0\" >Vicenta</td>\n",
       "      <td id=\"T_86d0a_row39_col1\" class=\"data row39 col1\" >Azcona</td>\n",
       "      <td id=\"T_86d0a_row39_col2\" class=\"data row39 col2\" >13</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_86d0a_row40_col0\" class=\"data row40 col0\" >Estela</td>\n",
       "      <td id=\"T_86d0a_row40_col1\" class=\"data row40 col1\" >Cortes</td>\n",
       "      <td id=\"T_86d0a_row40_col2\" class=\"data row40 col2\" >13</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_86d0a_row41_col0\" class=\"data row41 col0\" >Ariadna</td>\n",
       "      <td id=\"T_86d0a_row41_col1\" class=\"data row41 col1\" >Carlos</td>\n",
       "      <td id=\"T_86d0a_row41_col2\" class=\"data row41 col2\" >12</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_86d0a_row42_col0\" class=\"data row42 col0\" >Mariana</td>\n",
       "      <td id=\"T_86d0a_row42_col1\" class=\"data row42 col1\" >Mir</td>\n",
       "      <td id=\"T_86d0a_row42_col2\" class=\"data row42 col2\" >12</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_86d0a_row43_col0\" class=\"data row43 col0\" >Trinidad</td>\n",
       "      <td id=\"T_86d0a_row43_col1\" class=\"data row43 col1\" >Echeverría</td>\n",
       "      <td id=\"T_86d0a_row43_col2\" class=\"data row43 col2\" >12</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_86d0a_row44_col0\" class=\"data row44 col0\" >Candela</td>\n",
       "      <td id=\"T_86d0a_row44_col1\" class=\"data row44 col1\" >Solano</td>\n",
       "      <td id=\"T_86d0a_row44_col2\" class=\"data row44 col2\" >12</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_86d0a_row45_col0\" class=\"data row45 col0\" >Jose Francisco</td>\n",
       "      <td id=\"T_86d0a_row45_col1\" class=\"data row45 col1\" >Sobrino</td>\n",
       "      <td id=\"T_86d0a_row45_col2\" class=\"data row45 col2\" >12</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_86d0a_row46_col0\" class=\"data row46 col0\" >Bruno</td>\n",
       "      <td id=\"T_86d0a_row46_col1\" class=\"data row46 col1\" >Bayo</td>\n",
       "      <td id=\"T_86d0a_row46_col2\" class=\"data row46 col2\" >11</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_86d0a_row47_col0\" class=\"data row47 col0\" >Feliciana</td>\n",
       "      <td id=\"T_86d0a_row47_col1\" class=\"data row47 col1\" >Cantón</td>\n",
       "      <td id=\"T_86d0a_row47_col2\" class=\"data row47 col2\" >11</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_86d0a_row48_col0\" class=\"data row48 col0\" >Victorino</td>\n",
       "      <td id=\"T_86d0a_row48_col1\" class=\"data row48 col1\" >Alemany</td>\n",
       "      <td id=\"T_86d0a_row48_col2\" class=\"data row48 col2\" >11</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_86d0a_row49_col0\" class=\"data row49 col0\" >Georgina</td>\n",
       "      <td id=\"T_86d0a_row49_col1\" class=\"data row49 col1\" >Talavera</td>\n",
       "      <td id=\"T_86d0a_row49_col2\" class=\"data row49 col2\" >11</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_86d0a_row50_col0\" class=\"data row50 col0\" >Adela</td>\n",
       "      <td id=\"T_86d0a_row50_col1\" class=\"data row50 col1\" >Jaén</td>\n",
       "      <td id=\"T_86d0a_row50_col2\" class=\"data row50 col2\" >11</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_86d0a_row51_col0\" class=\"data row51 col0\" >David</td>\n",
       "      <td id=\"T_86d0a_row51_col1\" class=\"data row51 col1\" >Campo</td>\n",
       "      <td id=\"T_86d0a_row51_col2\" class=\"data row51 col2\" >11</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_86d0a_row52_col0\" class=\"data row52 col0\" >María Belén</td>\n",
       "      <td id=\"T_86d0a_row52_col1\" class=\"data row52 col1\" >Esteve</td>\n",
       "      <td id=\"T_86d0a_row52_col2\" class=\"data row52 col2\" >10</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_86d0a_row53_col0\" class=\"data row53 col0\" >Ciro</td>\n",
       "      <td id=\"T_86d0a_row53_col1\" class=\"data row53 col1\" >Guzmán</td>\n",
       "      <td id=\"T_86d0a_row53_col2\" class=\"data row53 col2\" >9</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_86d0a_row54_col0\" class=\"data row54 col0\" >Sabina</td>\n",
       "      <td id=\"T_86d0a_row54_col1\" class=\"data row54 col1\" >Martín</td>\n",
       "      <td id=\"T_86d0a_row54_col2\" class=\"data row54 col2\" >9</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_86d0a_row55_col0\" class=\"data row55 col0\" >Dani</td>\n",
       "      <td id=\"T_86d0a_row55_col1\" class=\"data row55 col1\" >Parejo</td>\n",
       "      <td id=\"T_86d0a_row55_col2\" class=\"data row55 col2\" >9</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_86d0a_row56_col0\" class=\"data row56 col0\" >Amor</td>\n",
       "      <td id=\"T_86d0a_row56_col1\" class=\"data row56 col1\" >Bueno</td>\n",
       "      <td id=\"T_86d0a_row56_col2\" class=\"data row56 col2\" >8</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_86d0a_row57_col0\" class=\"data row57 col0\" >Pastor</td>\n",
       "      <td id=\"T_86d0a_row57_col1\" class=\"data row57 col1\" >Martín</td>\n",
       "      <td id=\"T_86d0a_row57_col2\" class=\"data row57 col2\" >8</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_86d0a_row58_col0\" class=\"data row58 col0\" >Segismundo</td>\n",
       "      <td id=\"T_86d0a_row58_col1\" class=\"data row58 col1\" >Solera</td>\n",
       "      <td id=\"T_86d0a_row58_col2\" class=\"data row58 col2\" >7</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <td id=\"T_86d0a_row59_col0\" class=\"data row59 col0\" >Paula</td>\n",
       "      <td id=\"T_86d0a_row59_col1\" class=\"data row59 col1\" >Pardo</td>\n",
       "      <td id=\"T_86d0a_row59_col2\" class=\"data row59 col2\" >4</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n"
      ],
      "text/plain": [
       "<pandas.io.formats.style.Styler at 0x7f21ee6a4ad0>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "nombre_base = \"clase\"\n",
    "coleccion = \"reservas\"\n",
    "db = client[nombre_base]\n",
    "estados = [\"Confirmada\",\"Pagada\"]\n",
    "filtro = {\"estado\": {\"$in\":estados}}\n",
    "\n",
    "pipeline =[ \n",
    "    {\"$match\": filtro},\n",
    "    {\"$group\": {\n",
    "        \"_id\": \"$usuario_id\",  # este es el ID del usuario\n",
    "        \"Reservas_concretadas\": {\"$sum\": 1}\n",
    "    }},\n",
    "    {\"$lookup\": {\n",
    "        \"from\": \"usuarios\",           # nombre de la colección a unir\n",
    "        \"localField\": \"_id\",          # campo en esta colección (el ID del usuario)\n",
    "        \"foreignField\": \"usuario_id\",        # campo en la colección \"usuarios\"\n",
    "        \"as\": \"usuario_info\"          # nombre del nuevo campo con los datos del usuario\n",
    "    }},\n",
    "    {\"$unwind\": \"$usuario_info\"},     # desanida el array para acceder directamente\n",
    "    {\"$project\": {\n",
    "        \"_id\": 0,\n",
    "        \"Nombre\": \"$usuario_info.nombre\",\n",
    "        \"Apellido\": \"$usuario_info.apellido\",\n",
    "        \"Reservas_concretadas\": 1\n",
    "    }},\n",
    "    {\"$sort\": {\"Reservas_concretadas\": -1}}\n",
    "]\n",
    "\n",
    "resultado = redis.obtener_cache(coleccion, filtro)\n",
    "if resultado is None:\n",
    "    print(\"Consulta hecha en Mongo\")\n",
    "    cursor = db[coleccion].aggregate(pipeline)\n",
    "    resultado = list(cursor)\n",
    "    if resultado:\n",
    "        redis.guardar_en_cache(coleccion,filtro,resultado,ttl=300)\n",
    "else:\n",
    "    print(\"Consulta hecha en Redis\")\n",
    "        \n",
    "df = pd.DataFrame(resultado)\n",
    "df = df[[\"Nombre\", \"Apellido\", \"Reservas_concretadas\"]]\n",
    "display(df.style.hide(axis=\"index\"))"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "f0c3f88f-a292-4d2a-bc23-4c7053004160",
   "metadata": {},
   "source": [
    "#### Estadísticas"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "b2edec22-518e-4844-8ec9-fb257dfae711",
   "metadata": {},
   "source": [
    "###### i.Destino más visitado"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 71,
   "id": "fd3c30e8-6d5a-4866-997a-90b4b628b457",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Destino mas vistado\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<style type=\"text/css\">\n",
       "</style>\n",
       "<table id=\"T_9a089\">\n",
       "  <thead>\n",
       "    <tr>\n",
       "      <th id=\"T_9a089_level0_col0\" class=\"col_heading level0 col0\" >Destino</th>\n",
       "      <th id=\"T_9a089_level0_col1\" class=\"col_heading level0 col1\" >Cantidad_Visitas</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <td id=\"T_9a089_row0_col0\" class=\"data row0 col0\" >Posadas</td>\n",
       "      <td id=\"T_9a089_row0_col1\" class=\"data row0 col1\" >51</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n"
      ],
      "text/plain": [
       "<pandas.io.formats.style.Styler at 0x7f21ec76e150>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "nnombre_base = \"clase\"\n",
    "coleccion = \"reservas\"\n",
    "db = client[nombre_base]\n",
    "estados = [\"Confirmada\",\"Pagada\"]\n",
    "filtro = {\"estado\": {\"$in\":estados}}\n",
    "\n",
    "pipeline =[ \n",
    "    {\"$match\": filtro},\n",
    "    {\"$group\": {\n",
    "        \"_id\": \"$destino_id\",  # este es el ID del destino\n",
    "        \"Cantidad_Visitas\": {\"$sum\": 1}\n",
    "    }},\n",
    "    {\"$lookup\": {\n",
    "        \"from\": \"destinos\",           # nombre de la colección a unir\n",
    "        \"localField\": \"_id\",          # campo en esta colección (el ID del destino)\n",
    "        \"foreignField\": \"destino_id\",        # campo en la colección \"usuarios\"\n",
    "        \"as\": \"destino_visitas\"          # nombre del nuevo campo con los datos del usuario\n",
    "    }},\n",
    "    {\"$unwind\": \"$destino_visitas\"},     # desanida el array para acceder directamente\n",
    "    {\"$project\": {\n",
    "        \"_id\": 0,\n",
    "        \"Destino\": \"$destino_visitas.ciudad\",\n",
    "        \"Cantidad_Visitas\": 1\n",
    "    }},\n",
    "    {\"$sort\": {\"Cantidad_Visitas\": -1}},\n",
    "    {\"$limit\": 1}\n",
    "]\n",
    "\n",
    "cursor = db[coleccion].aggregate(pipeline)\n",
    "resultado = list(cursor)\n",
    "\n",
    "      \n",
    "df = pd.DataFrame(resultado)\n",
    "df = df[[\"Destino\", \"Cantidad_Visitas\"]]\n",
    "print(\"Destino mas vistado\")\n",
    "display(df.style.hide(axis=\"index\"))"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "b2152a43-66c6-4852-9805-dba7d5f58831",
   "metadata": {},
   "source": [
    "###### ii.Hotel más barato"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 78,
   "id": "d026968b-61f6-45fb-9c32-588f34d5a28b",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Hotel mas barato\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<style type=\"text/css\">\n",
       "</style>\n",
       "<table id=\"T_5e112\">\n",
       "  <thead>\n",
       "    <tr>\n",
       "      <th id=\"T_5e112_level0_col0\" class=\"col_heading level0 col0\" >Hotel</th>\n",
       "      <th id=\"T_5e112_level0_col1\" class=\"col_heading level0 col1\" >Ciudad</th>\n",
       "      <th id=\"T_5e112_level0_col2\" class=\"col_heading level0 col2\" >Precio_minimo</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <td id=\"T_5e112_row0_col0\" class=\"data row0 col0\" >Hnos Reyes S.A. Hotel</td>\n",
       "      <td id=\"T_5e112_row0_col1\" class=\"data row0 col1\" >Río Cuarto</td>\n",
       "      <td id=\"T_5e112_row0_col2\" class=\"data row0 col2\" >47125</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n"
      ],
      "text/plain": [
       "<pandas.io.formats.style.Styler at 0x7f21ea90f710>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "nombre_base = \"clase\"\n",
    "coleccion = \"reservas\"\n",
    "db = client[nombre_base]\n",
    "estados = [\"Confirmada\",\"Pagada\"]\n",
    "filtro = {\"estado\": {\"$in\":estados}}\n",
    "\n",
    "pipeline =[ \n",
    "    {\"$match\": filtro},\n",
    "    {\"$group\": {\n",
    "        \"_id\": \"$hotel_id\",  # este es id del hotel\n",
    "        \"Precio_minimo\": {\"$min\": \"$precio_total\"} #el minimo del campo precio_total\n",
    "    }},\n",
    "    {\"$lookup\": {\n",
    "        \"from\": \"hoteles\",           # nombre de la colección a unir\n",
    "        \"localField\": \"_id\",          # campo en esta colección (el ID del destino)\n",
    "        \"foreignField\": \"hotel_id\",        # campo en la colección \"usuarios\"\n",
    "        \"as\": \"hoteles_min_precios\"          # nombre del nuevo campo con los datos del usuario\n",
    "    }},\n",
    "    {\"$unwind\": \"$hoteles_min_precios\"},     # desanida el array para acceder directamente\n",
    "    {\"$project\": {\n",
    "        \"_id\": 0,\n",
    "        \"Hotel\": \"$hoteles_min_precios.nombre\",\n",
    "        \"Ciudad\": \"$hoteles_min_precios.ciudad\",\n",
    "        \"Precio_minimo\": 1\n",
    "    }},\n",
    "    {\"$sort\": {\"Precio_minimo\": 1}},\n",
    "    {\"$limit\": 1}\n",
    "]\n",
    "\n",
    "cursor = db[coleccion].aggregate(pipeline)\n",
    "resultado = list(cursor)\n",
    "\n",
    "      \n",
    "df = pd.DataFrame(resultado)\n",
    "df = df[[\"Hotel\", \"Ciudad\",\"Precio_minimo\"]]\n",
    "print(\"Hotel mas barato\")\n",
    "display(df.style.hide(axis=\"index\"))"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "34787108-84f9-4b3f-bc0a-d33309b8c2f5",
   "metadata": {},
   "source": [
    "###### iii.Actividad más popular."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "ab81879e-19a5-4d5e-9d81-fc9f23e1d287",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "id": "5eae57b1-ec8b-469b-8033-8fde97d62c5a",
   "metadata": {},
   "source": [
    "#### Modificaciones"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "22039522-23ad-47ac-a709-50975130084b",
   "metadata": {},
   "source": [
    "###### a.Incrementar el precio de las actividades de Tucuman en 5% "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 80,
   "id": "08275133",
   "metadata": {},
   "outputs": [],
   "source": [
    "\n",
    "# Ejemplo: destino más visitado import\n",
    "import matplotlib.pyplot as plt\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 82,
   "id": "f405f561-4830-41a9-86ec-ac44c0915338",
   "metadata": {},
   "outputs": [
    {
     "ename": "TypeError",
     "evalue": "string indices must be integers, not 'str'",
     "output_type": "error",
     "traceback": [
      "\u001b[31m---------------------------------------------------------------------------\u001b[39m",
      "\u001b[31mTypeError\u001b[39m                                 Traceback (most recent call last)",
      "\u001b[36mCell\u001b[39m\u001b[36m \u001b[39m\u001b[32mIn[82]\u001b[39m\u001b[32m, line 8\u001b[39m\n\u001b[32m      5\u001b[39m agg = \u001b[38;5;28mlist\u001b[39m(db.reservas.aggregate([{\u001b[33m'\u001b[39m\u001b[33m$group\u001b[39m\u001b[33m'\u001b[39m:\n\u001b[32m      6\u001b[39m {\u001b[33m'\u001b[39m\u001b[33m_id\u001b[39m\u001b[33m'\u001b[39m:\u001b[33m'\u001b[39m\u001b[33m$destino_id\u001b[39m\u001b[33m'\u001b[39m, \u001b[33m'\u001b[39m\u001b[33mcantidad\u001b[39m\u001b[33m'\u001b[39m: {\u001b[33m'\u001b[39m\u001b[33m$sum\u001b[39m\u001b[33m'\u001b[39m:\u001b[32m1\u001b[39m}}}]))\n\u001b[32m      7\u001b[39m \u001b[38;5;66;03m# Mapear destino_id a ciudad\u001b[39;00m\n\u001b[32m----> \u001b[39m\u001b[32m8\u001b[39m id_to_ciudad = \u001b[43m{\u001b[49m\u001b[43md\u001b[49m\u001b[43m[\u001b[49m\u001b[33;43m'\u001b[39;49m\u001b[33;43mdestino_id\u001b[39;49m\u001b[33;43m'\u001b[39;49m\u001b[43m]\u001b[49m\u001b[43m:\u001b[49m\u001b[43m \u001b[49m\u001b[43md\u001b[49m\u001b[43m[\u001b[49m\u001b[33;43m'\u001b[39;49m\u001b[33;43mciudad\u001b[39;49m\u001b[33;43m'\u001b[39;49m\u001b[43m]\u001b[49m\u001b[43m \u001b[49m\u001b[38;5;28;43;01mfor\u001b[39;49;00m\u001b[43m \u001b[49m\u001b[43md\u001b[49m\u001b[43m \u001b[49m\u001b[38;5;129;43;01min\u001b[39;49;00m\n\u001b[32m      9\u001b[39m \u001b[43mdestinos\u001b[49m\u001b[43m}\u001b[49m\n\u001b[32m     10\u001b[39m ciudades = [id_to_ciudad.get(a[\u001b[33m'\u001b[39m\u001b[33m_id\u001b[39m\u001b[33m'\u001b[39m], \u001b[38;5;28mstr\u001b[39m(a[\u001b[33m'\u001b[39m\u001b[33m_id\u001b[39m\u001b[33m'\u001b[39m]))\n\u001b[32m     11\u001b[39m \u001b[38;5;28;01mfor\u001b[39;00m a \u001b[38;5;129;01min\u001b[39;00m agg]\n\u001b[32m     12\u001b[39m valores = [a[\u001b[33m'\u001b[39m\u001b[33mcantidad\u001b[39m\u001b[33m'\u001b[39m] \u001b[38;5;28;01mfor\u001b[39;00m a \u001b[38;5;129;01min\u001b[39;00m agg]\n",
      "\u001b[36mCell\u001b[39m\u001b[36m \u001b[39m\u001b[32mIn[82]\u001b[39m\u001b[32m, line 8\u001b[39m, in \u001b[36m<dictcomp>\u001b[39m\u001b[34m(.0)\u001b[39m\n\u001b[32m      5\u001b[39m agg = \u001b[38;5;28mlist\u001b[39m(db.reservas.aggregate([{\u001b[33m'\u001b[39m\u001b[33m$group\u001b[39m\u001b[33m'\u001b[39m:\n\u001b[32m      6\u001b[39m {\u001b[33m'\u001b[39m\u001b[33m_id\u001b[39m\u001b[33m'\u001b[39m:\u001b[33m'\u001b[39m\u001b[33m$destino_id\u001b[39m\u001b[33m'\u001b[39m, \u001b[33m'\u001b[39m\u001b[33mcantidad\u001b[39m\u001b[33m'\u001b[39m: {\u001b[33m'\u001b[39m\u001b[33m$sum\u001b[39m\u001b[33m'\u001b[39m:\u001b[32m1\u001b[39m}}}]))\n\u001b[32m      7\u001b[39m \u001b[38;5;66;03m# Mapear destino_id a ciudad\u001b[39;00m\n\u001b[32m----> \u001b[39m\u001b[32m8\u001b[39m id_to_ciudad = {\u001b[43md\u001b[49m\u001b[43m[\u001b[49m\u001b[33;43m'\u001b[39;49m\u001b[33;43mdestino_id\u001b[39;49m\u001b[33;43m'\u001b[39;49m\u001b[43m]\u001b[49m: d[\u001b[33m'\u001b[39m\u001b[33mciudad\u001b[39m\u001b[33m'\u001b[39m] \u001b[38;5;28;01mfor\u001b[39;00m d \u001b[38;5;129;01min\u001b[39;00m\n\u001b[32m      9\u001b[39m destinos}\n\u001b[32m     10\u001b[39m ciudades = [id_to_ciudad.get(a[\u001b[33m'\u001b[39m\u001b[33m_id\u001b[39m\u001b[33m'\u001b[39m], \u001b[38;5;28mstr\u001b[39m(a[\u001b[33m'\u001b[39m\u001b[33m_id\u001b[39m\u001b[33m'\u001b[39m]))\n\u001b[32m     11\u001b[39m \u001b[38;5;28;01mfor\u001b[39;00m a \u001b[38;5;129;01min\u001b[39;00m agg]\n\u001b[32m     12\u001b[39m valores = [a[\u001b[33m'\u001b[39m\u001b[33mcantidad\u001b[39m\u001b[33m'\u001b[39m] \u001b[38;5;28;01mfor\u001b[39;00m a \u001b[38;5;129;01min\u001b[39;00m agg]\n",
      "\u001b[31mTypeError\u001b[39m: string indices must be integers, not 'str'"
     ]
    }
   ],
   "source": [
    "nombre_base = \"clase\"\n",
    "coleccion = \"reservas\"\n",
    "db = client[nombre_base]\n",
    "# Obtener conteo de reservas por destino (Mongo)\n",
    "agg = list(db.reservas.aggregate([{'$group':\n",
    "{'_id':'$destino_id', 'cantidad': {'$sum':1}}}]))\n",
    "# Mapear destino_id a ciudad\n",
    "id_to_ciudad = {d['destino_id']: d['ciudad'] for d in\n",
    "destinos}\n",
    "ciudades = [id_to_ciudad.get(a['_id'], str(a['_id']))\n",
    "for a in agg]\n",
    "valores = [a['cantidad'] for a in agg]\n",
    "plt.figure(figsize=(6,3))\n",
    "plt.bar(ciudades, valores)\n",
    "plt.title('Reservas por destino')\n",
    "plt.ylabel('Cantidad reservas')\n",
    "plt.show()\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "22a527ac-90a3-4e39-8141-44c9ce298bcd",
   "metadata": {},
   "source": [
    "###### b. Agregar al hotel id=1 el servicio de SPA "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "6a4ca203-b270-4065-aee4-9cab7121cc7c",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "id": "030c6c43-2a5a-46ef-89b1-a2c30b55cd88",
   "metadata": {},
   "source": [
    "###### c. Eliminar el destino que desee"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "45c2c505-b08f-4ec4-b50a-0d9760d3bc92",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "id": "2ce976cf-093e-4c08-a0f5-d3910abe2efb",
   "metadata": {},
   "source": [
    "###### d. Eliminar un usuario que desee "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "c6bdaa62-84ae-4ebb-8ca3-78d6a8348d03",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "id": "21d70e0e-8ab8-445c-bbdd-6dc6dac891cc",
   "metadata": {},
   "source": [
    "###### e. Eliminar las relaciones AMIGO_DE para un usuario que quiera. "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "8a3c02e7-191b-424a-ba1b-5bd2f4aa91b7",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.14"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
